remotemcu/remcu-chip-sdks/SAM/xdk-asf-3.45.0/sam0/utils/cmsis/samb11/include/pio/samb11zr.h
/**
 * \file
 *
 * \brief Peripheral I/O description for SAMB11ZR
 *
 * Copyright (c) 2016-2018 Microchip Technology Inc. and its subsidiaries.
 *
 * \asf_license_start
 *
 * \page License
 *
 * Subject to your compliance with these terms, you may use Microchip
 * software and any derivatives exclusively with Microchip products.
 * It is your responsibility to comply with third party license terms applicable
 * to your use of third party software (including open source software) that
 * may accompany Microchip software.
 *
 * THIS SOFTWARE IS SUPPLIED BY MICROCHIP "AS IS". NO WARRANTIES,
 * WHETHER EXPRESS, IMPLIED OR STATUTORY, APPLY TO THIS SOFTWARE,
 * INCLUDING ANY IMPLIED WARRANTIES OF NON-INFRINGEMENT, MERCHANTABILITY,
 * AND FITNESS FOR A PARTICULAR PURPOSE. IN NO EVENT WILL MICROCHIP BE
 * LIABLE FOR ANY INDIRECT, SPECIAL, PUNITIVE, INCIDENTAL OR CONSEQUENTIAL
 * LOSS, DAMAGE, COST OR EXPENSE OF ANY KIND WHATSOEVER RELATED TO THE
 * SOFTWARE, HOWEVER CAUSED, EVEN IF MICROCHIP HAS BEEN ADVISED OF THE
 * POSSIBILITY OR THE DAMAGES ARE FORESEEABLE.  TO THE FULLEST EXTENT
 * ALLOWED BY LAW, MICROCHIP'S TOTAL LIABILITY ON ALL CLAIMS IN ANY WAY
 * RELATED TO THIS SOFTWARE WILL NOT EXCEED THE AMOUNT OF FEES, IF ANY,
 * THAT YOU HAVE PAID DIRECTLY TO MICROCHIP FOR THIS SOFTWARE.
 *
 * \asf_license_stop
 *
 */

#ifndef _SAMB11ZR_PIO_
#define _SAMB11ZR_PIO_

#define PIN_LP_GPIO_0                     0  /**< Pin Number for LP_GPIO_0 */
#define GPIO_LP_GPIO_0           (1ul <<  0) /**< GPIO Mask for LP_GPIO_0 */
#define PIN_LP_GPIO_1                     1  /**< Pin Number for LP_GPIO_1 */
#define GPIO_LP_GPIO_1           (1ul <<  1) /**< GPIO Mask for LP_GPIO_1 */
#define PIN_LP_GPIO_2                     2  /**< Pin Number for LP_GPIO_2 */
#define GPIO_LP_GPIO_2           (1ul <<  2) /**< GPIO Mask for LP_GPIO_2 */
#define PIN_LP_GPIO_3                     3  /**< Pin Number for LP_GPIO_3 */
#define GPIO_LP_GPIO_3           (1ul <<  3) /**< GPIO Mask for LP_GPIO_3 */
#define PIN_LP_GPIO_4                     4  /**< Pin Number for LP_GPIO_4 */
#define GPIO_LP_GPIO_4           (1ul <<  4) /**< GPIO Mask for LP_GPIO_4 */
#define PIN_LP_GPIO_5                     5  /**< Pin Number for LP_GPIO_5 */
#define GPIO_LP_GPIO_5           (1ul <<  5) /**< GPIO Mask for LP_GPIO_5 */
#define PIN_LP_GPIO_6                     6  /**< Pin Number for LP_GPIO_6 */
#define GPIO_LP_GPIO_6           (1ul <<  6) /**< GPIO Mask for LP_GPIO_6 */
#define PIN_LP_GPIO_7                     7  /**< Pin Number for LP_GPIO_7 */
#define GPIO_LP_GPIO_7           (1ul <<  7) /**< GPIO Mask for LP_GPIO_7 */
#define PIN_LP_GPIO_8                     8  /**< Pin Number for LP_GPIO_8 */
#define GPIO_LP_GPIO_8           (1ul <<  8) /**< GPIO Mask for LP_GPIO_8 */
#define PIN_LP_GPIO_9                     9  /**< Pin Number for LP_GPIO_9 */
#define GPIO_LP_GPIO_9           (1ul <<  9) /**< GPIO Mask for LP_GPIO_9 */
#define PIN_LP_GPIO_10                   10  /**< Pin Number for LP_GPIO_10 */
#define GPIO_LP_GPIO_10          (1ul << 10) /**< GPIO Mask for LP_GPIO_10 */
#define PIN_LP_GPIO_11                   11  /**< Pin Number for LP_GPIO_11 */
#define GPIO_LP_GPIO_11          (1ul << 11) /**< GPIO Mask for LP_GPIO_11 */
#define PIN_LP_GPIO_12                   12  /**< Pin Number for LP_GPIO_12 */
#define GPIO_LP_GPIO_12          (1ul << 12) /**< GPIO Mask for LP_GPIO_12 */
#define PIN_LP_GPIO_13                   13  /**< Pin Number for LP_GPIO_13 */
#define GPIO_LP_GPIO_13          (1ul << 13) /**< GPIO Mask for LP_GPIO_13 */
#define PIN_LP_GPIO_14                   14  /**< Pin Number for LP_GPIO_14 */
#define GPIO_LP_GPIO_14          (1ul << 14) /**< GPIO Mask for LP_GPIO_14 */
#define PIN_LP_GPIO_15                   15  /**< Pin Number for LP_GPIO_15 */
#define GPIO_LP_GPIO_15          (1ul << 15) /**< GPIO Mask for LP_GPIO_15 */
#define PIN_LP_GPIO_16                   16  /**< Pin Number for LP_GPIO_16 */
#define GPIO_LP_GPIO_16          (1ul <<  0) /**< GPIO Mask for LP_GPIO_16 */
#define PIN_LP_GPIO_17                   17  /**< Pin Number for LP_GPIO_17 */
#define GPIO_LP_GPIO_17          (1ul <<  1) /**< GPIO Mask for LP_GPIO_17 */
#define PIN_LP_GPIO_18                   18  /**< Pin Number for LP_GPIO_18 */
#define GPIO_LP_GPIO_18          (1ul <<  2) /**< GPIO Mask for LP_GPIO_18 */
#define PIN_LP_GPIO_19                   19  /**< Pin Number for LP_GPIO_19 */
#define GPIO_LP_GPIO_19          (1ul <<  3) /**< GPIO Mask for LP_GPIO_19 */
#define PIN_AO_GPIO_2                    29  /**< Pin Number for AO_GPIO_2 */
#define GPIO_AO_GPIO_2           (1ul << 13) /**< GPIO Mask for AO_GPIO_2 */
#define PIN_AO_GPIO_1                    30  /**< Pin Number for AO_GPIO_1 */
#define GPIO_AO_GPIO_1           (1ul << 14) /**< GPIO Mask for AO_GPIO_1 */
#define PIN_AO_GPIO_0                    31  /**< Pin Number for AO_GPIO_0 */
#define GPIO_AO_GPIO_0           (1ul << 15) /**< GPIO Mask for AO_GPIO_0 */
#define PIN_GPIO_MS4                     44  /**< Pin Number for GPIO_MS4 */
#define GPIO_GPIO_MS4            (1ul << 12) /**< GPIO Mask for GPIO_MS4 */
#define PIN_GPIO_MS3                     45  /**< Pin Number for GPIO_MS3 */
#define GPIO_GPIO_MS3            (1ul << 13) /**< GPIO Mask for GPIO_MS3 */
#define PIN_GPIO_MS2                     46  /**< Pin Number for GPIO_MS2 */
#define GPIO_GPIO_MS2            (1ul << 14) /**< GPIO Mask for GPIO_MS2 */
#define PIN_GPIO_MS1                     47  /**< Pin Number for GPIO_MS1 */
#define GPIO_GPIO_MS1            (1ul << 15) /**< GPIO Mask for GPIO_MS1 */

/* PinMux definitions                                               */
/* Mux values for LP_GPIO_0 */
#define MUX_LP_GPIO_0_GPIO                     0x0
#define MUX_LP_GPIO_0_MEGAMUX                  0x1
#define MUX_LP_GPIO_0_SWD_CLK                  0x2
#define MUX_LP_GPIO_0_TEST_OUT_0               0x7
/* Mux values for LP_GPIO_1 */
#define MUX_LP_GPIO_1_GPIO                     0x0
#define MUX_LP_GPIO_1_SWD_IO                   0x2
#define MUX_LP_GPIO_1_MEGAMUX                  0x1
#define MUX_LP_GPIO_1_TEST_OUT_1               0x7
/* Mux values for LP_GPIO_2 */
#define MUX_LP_GPIO_2_MEGAMUX                  0x1
#define MUX_LP_GPIO_2_SPI_FLASH0_SCK           0x6
#define MUX_LP_GPIO_2_SPI1_SCK                 0x4
#define MUX_LP_GPIO_2_TEST_OUT_2               0x7
#define MUX_LP_GPIO_2_UART0_RXD                0x2
#define MUX_LP_GPIO_2_GPIO                     0x0
#define MUX_LP_GPIO_2_SPI0_SCK                 0x5
/* Mux values for LP_GPIO_3 */
#define MUX_LP_GPIO_3_UART0_TXD                0x2
#define MUX_LP_GPIO_3_SPI0_MOSI                0x5
#define MUX_LP_GPIO_3_MEGAMUX                  0x1
#define MUX_LP_GPIO_3_SPI1_MOSI                0x4
#define MUX_LP_GPIO_3_SPI_FLASH0_TXD           0x6
#define MUX_LP_GPIO_3_TEST_OUT_3               0x7
#define MUX_LP_GPIO_3_GPIO                     0x0
/* Mux values for LP_GPIO_4 */
#define MUX_LP_GPIO_4_MEGAMUX                  0x1
#define MUX_LP_GPIO_4_UART0_CTS                0x2
#define MUX_LP_GPIO_4_SPI0_SSN                 0x5
#define MUX_LP_GPIO_4_SPI_FLASH0_SSN           0x6
#define MUX_LP_GPIO_4_TEST_OUT_4               0x7
#define MUX_LP_GPIO_4_GPIO                     0x0
#define MUX_LP_GPIO_4_SPI1_SSN                 0x4
/* Mux values for LP_GPIO_5 */
#define MUX_LP_GPIO_5_SPI_FLASH0_RXD           0x6
#define MUX_LP_GPIO_5_MEGAMUX                  0x1
#define MUX_LP_GPIO_5_SPI0_MISO                0x5
#define MUX_LP_GPIO_5_SPI1_MISO                0x4
#define MUX_LP_GPIO_5_TEST_OUT_5               0x7
#define MUX_LP_GPIO_5_UART0_RTS                0x2
#define MUX_LP_GPIO_5_GPIO                     0x0
/* Mux values for LP_GPIO_6 */
#define MUX_LP_GPIO_6_MEGAMUX                  0x1
#define MUX_LP_GPIO_6_SPI_FLASH0_SCK           0x6
#define MUX_LP_GPIO_6_UART1_RXD                0x2
#define MUX_LP_GPIO_6_TEST_OUT_6               0x7
#define MUX_LP_GPIO_6_GPIO                     0x0
#define MUX_LP_GPIO_6_SPI0_SCK                 0x5
/* Mux values for LP_GPIO_7 */
#define MUX_LP_GPIO_7_SPI0_MOSI                0x5
#define MUX_LP_GPIO_7_UART1_TXD                0x2
#define MUX_LP_GPIO_7_MEGAMUX                  0x1
#define MUX_LP_GPIO_7_TEST_OUT_7               0x7
#define MUX_LP_GPIO_7_SPI_FLASH0_TXD           0x6
#define MUX_LP_GPIO_7_GPIO                     0x0
/* Mux values for LP_GPIO_8 */
#define MUX_LP_GPIO_8_MEGAMUX                  0x1
#define MUX_LP_GPIO_8_SPI0_SSN                 0x5
#define MUX_LP_GPIO_8_SPI_FLASH0_SSN           0x6
#define MUX_LP_GPIO_8_GPIO                     0x0
#define MUX_LP_GPIO_8_I2C0_SDA                 0x2
#define MUX_LP_GPIO_8_TEST_OUT_8               0x7
/* Mux values for LP_GPIO_9 */
#define MUX_LP_GPIO_9_SPI_FLASH0_RXD           0x6
#define MUX_LP_GPIO_9_MEGAMUX                  0x1
#define MUX_LP_GPIO_9_SPI0_MISO                0x5
#define MUX_LP_GPIO_9_I2C0_SCL                 0x2
#define MUX_LP_GPIO_9_GPIO                     0x0
#define MUX_LP_GPIO_9_TEST_OUT_9               0x7
/* Mux values for LP_GPIO_10 */
#define MUX_LP_GPIO_10_GPIO                    0x0
#define MUX_LP_GPIO_10_MEGAMUX                 0x1
#define MUX_LP_GPIO_10_TEST_OUT_10             0x7
#define MUX_LP_GPIO_10_SPI_FLASH0_SCK          0x6
#define MUX_LP_GPIO_10_SPI0_SCK                0x2
/* Mux values for LP_GPIO_11 */
#define MUX_LP_GPIO_11_SPI0_MOSI               0x2
#define MUX_LP_GPIO_11_GPIO                    0x0
#define MUX_LP_GPIO_11_MEGAMUX                 0x1
#define MUX_LP_GPIO_11_SPI_FLASH0_TXD          0x6
#define MUX_LP_GPIO_11_TEST_OUT_11             0x7
/* Mux values for LP_GPIO_12 */
#define MUX_LP_GPIO_12_SPI_FLASH0_SSN          0x6
#define MUX_LP_GPIO_12_GPIO                    0x0
#define MUX_LP_GPIO_12_SPI0_SSN                0x2
#define MUX_LP_GPIO_12_MEGAMUX                 0x1
#define MUX_LP_GPIO_12_TEST_OUT_12             0x7
/* Mux values for LP_GPIO_13 */
#define MUX_LP_GPIO_13_GPIO                    0x0
#define MUX_LP_GPIO_13_SPI_FLASH0_RXD          0x6
#define MUX_LP_GPIO_13_MEGAMUX                 0x1
#define MUX_LP_GPIO_13_SPI0_MISO               0x2
#define MUX_LP_GPIO_13_TEST_OUT_13             0x7
/* Mux values for LP_GPIO_14 */
#define MUX_LP_GPIO_14_TEST_OUT_14             0x7
#define MUX_LP_GPIO_14_GPIO                    0x0
#define MUX_LP_GPIO_14_I2C1_SDA                0x4
#define MUX_LP_GPIO_14_MEGAMUX                 0x1
#define MUX_LP_GPIO_14_UART1_CTS               0x2
/* Mux values for LP_GPIO_15 */
#define MUX_LP_GPIO_15_GPIO                    0x0
#define MUX_LP_GPIO_15_MEGAMUX                 0x1
#define MUX_LP_GPIO_15_UART1_RTS               0x2
#define MUX_LP_GPIO_15_I2C1_SCL                0x4
#define MUX_LP_GPIO_15_TEST_OUT_15             0x7
/* Mux values for LP_GPIO_16 */
#define MUX_LP_GPIO_16_MEGAMUX                 0x1
#define MUX_LP_GPIO_16_SPI_FLASH0_SCK          0x2
#define MUX_LP_GPIO_16_TEST_OUT_16             0x7
#define MUX_LP_GPIO_16_SPI_FLASH0_SSN          0x6
#define MUX_LP_GPIO_16_GPIO                    0x0
#define MUX_LP_GPIO_16_SPI1_SSN                0x4
#define MUX_LP_GPIO_16_SPI0_SCK                0x5
/* Mux values for LP_GPIO_17 */
#define MUX_LP_GPIO_17_SPI0_MOSI               0x5
#define MUX_LP_GPIO_17_MEGAMUX                 0x1
#define MUX_LP_GPIO_17_TEST_OUT_17             0x7
#define MUX_LP_GPIO_17_SPI1_SCK                0x4
#define MUX_LP_GPIO_17_SPI_FLASH0_TXD          0x2
#define MUX_LP_GPIO_17_GPIO                    0x0
/* Mux values for LP_GPIO_18 */
#define MUX_LP_GPIO_18_SPI_FLASH0_RXD          0x6
#define MUX_LP_GPIO_18_MEGAMUX                 0x1
#define MUX_LP_GPIO_18_TEST_OUT_18             0x7
#define MUX_LP_GPIO_18_SPI0_SSN                0x5
#define MUX_LP_GPIO_18_SPI1_MISO               0x4
#define MUX_LP_GPIO_18_SPI_FLASH0_SSN          0x2
#define MUX_LP_GPIO_18_GPIO                    0x0
/* Mux values for LP_GPIO_19 */
#define MUX_LP_GPIO_19_SPI_FLASH0_RXD          0x2
#define MUX_LP_GPIO_19_MEGAMUX                 0x1
#define MUX_LP_GPIO_19_SPI0_MISO               0x5
#define MUX_LP_GPIO_19_TEST_OUT_19             0x7
#define MUX_LP_GPIO_19_SPI1_MOSI               0x4
#define MUX_LP_GPIO_19_GPIO                    0x0

