remotemcu/remcu-chip-sdks/SAM/xdk-asf-3.45.0/sam0/utils/cmsis/samb11/include/pio/samb11zr.h
/* PinMux macros for LP_GPIO_0 */
#define PINMUX_LP_GPIO_0_GPIO                     ( PIN_LP_GPIO_0<<16 | MUX_LP_GPIO_0_GPIO )
#define PINMUX_LP_GPIO_0_M_I2C0_SCL               ( PIN_LP_GPIO_0<<16 | MEGAMUX_LP_GPIO_0_I2C0_SCL<<8 | MUX_LP_GPIO_0_MEGAMUX )
#define PINMUX_LP_GPIO_0_M_UART1_CTS              ( PIN_LP_GPIO_0<<16 | MEGAMUX_LP_GPIO_0_UART1_CTS<<8 | MUX_LP_GPIO_0_MEGAMUX )
#define PINMUX_LP_GPIO_0_M_COEX_BLE_MBSY          ( PIN_LP_GPIO_0<<16 | MEGAMUX_LP_GPIO_0_COEX_BLE_MBSY<<8 | MUX_LP_GPIO_0_MEGAMUX )
#define PINMUX_LP_GPIO_0_M_COEX_BLE_TX            ( PIN_LP_GPIO_0<<16 | MEGAMUX_LP_GPIO_0_COEX_BLE_TX<<8 | MUX_LP_GPIO_0_MEGAMUX )
#define PINMUX_LP_GPIO_0_M_UART0_RTS              ( PIN_LP_GPIO_0<<16 | MEGAMUX_LP_GPIO_0_UART0_RTS<<8 | MUX_LP_GPIO_0_MEGAMUX )
#define PINMUX_LP_GPIO_0_M_UART0_RXD              ( PIN_LP_GPIO_0<<16 | MEGAMUX_LP_GPIO_0_UART0_RXD<<8 | MUX_LP_GPIO_0_MEGAMUX )
#define PINMUX_LP_GPIO_0_M_32KHZ_CLK              ( PIN_LP_GPIO_0<<16 | MEGAMUX_LP_GPIO_0_32KHZ_CLK<<8 | MUX_LP_GPIO_0_MEGAMUX )
#define PINMUX_LP_GPIO_0_M_COEX_BLE_IN_PROCESS    ( PIN_LP_GPIO_0<<16 | MEGAMUX_LP_GPIO_0_COEX_BLE_IN_PROCESS<<8 | MUX_LP_GPIO_0_MEGAMUX )
#define PINMUX_LP_GPIO_0_M_UART0_TXD              ( PIN_LP_GPIO_0<<16 | MEGAMUX_LP_GPIO_0_UART0_TXD<<8 | MUX_LP_GPIO_0_MEGAMUX )
#define PINMUX_LP_GPIO_0_M_UART1_TXD              ( PIN_LP_GPIO_0<<16 | MEGAMUX_LP_GPIO_0_UART1_TXD<<8 | MUX_LP_GPIO_0_MEGAMUX )
#define PINMUX_LP_GPIO_0_M_I2C1_SCL               ( PIN_LP_GPIO_0<<16 | MEGAMUX_LP_GPIO_0_I2C1_SCL<<8 | MUX_LP_GPIO_0_MEGAMUX )
#define PINMUX_LP_GPIO_0_M_COEX_WLAN_RX           ( PIN_LP_GPIO_0<<16 | MEGAMUX_LP_GPIO_0_COEX_WLAN_RX<<8 | MUX_LP_GPIO_0_MEGAMUX )
#define PINMUX_LP_GPIO_0_M_COEX_WLAN_TX           ( PIN_LP_GPIO_0<<16 | MEGAMUX_LP_GPIO_0_COEX_WLAN_TX<<8 | MUX_LP_GPIO_0_MEGAMUX )
#define PINMUX_LP_GPIO_0_M_PWM1_OUT               ( PIN_LP_GPIO_0<<16 | MEGAMUX_LP_GPIO_0_PWM1_OUT<<8 | MUX_LP_GPIO_0_MEGAMUX )
#define PINMUX_LP_GPIO_0_M_QUAD_DEC0_B            ( PIN_LP_GPIO_0<<16 | MEGAMUX_LP_GPIO_0_QUAD_DEC0_B<<8 | MUX_LP_GPIO_0_MEGAMUX )
#define PINMUX_LP_GPIO_0_M_UART1_RTS              ( PIN_LP_GPIO_0<<16 | MEGAMUX_LP_GPIO_0_UART1_RTS<<8 | MUX_LP_GPIO_0_MEGAMUX )
#define PINMUX_LP_GPIO_0_M_UART0_CTS              ( PIN_LP_GPIO_0<<16 | MEGAMUX_LP_GPIO_0_UART0_CTS<<8 | MUX_LP_GPIO_0_MEGAMUX )
#define PINMUX_LP_GPIO_0_M_UART1_RXD              ( PIN_LP_GPIO_0<<16 | MEGAMUX_LP_GPIO_0_UART1_RXD<<8 | MUX_LP_GPIO_0_MEGAMUX )
#define PINMUX_LP_GPIO_0_M_COEX_BLE_PTI_0         ( PIN_LP_GPIO_0<<16 | MEGAMUX_LP_GPIO_0_COEX_BLE_PTI_0<<8 | MUX_LP_GPIO_0_MEGAMUX )
#define PINMUX_LP_GPIO_0_M_COEX_BLE_PTI_1         ( PIN_LP_GPIO_0<<16 | MEGAMUX_LP_GPIO_0_COEX_BLE_PTI_1<<8 | MUX_LP_GPIO_0_MEGAMUX )
#define PINMUX_LP_GPIO_0_M_COEX_BLE_PTI_2         ( PIN_LP_GPIO_0<<16 | MEGAMUX_LP_GPIO_0_COEX_BLE_PTI_2<<8 | MUX_LP_GPIO_0_MEGAMUX )
#define PINMUX_LP_GPIO_0_M_COEX_BLE_PTI_3         ( PIN_LP_GPIO_0<<16 | MEGAMUX_LP_GPIO_0_COEX_BLE_PTI_3<<8 | MUX_LP_GPIO_0_MEGAMUX )
#define PINMUX_LP_GPIO_0_M_I2C1_SDA               ( PIN_LP_GPIO_0<<16 | MEGAMUX_LP_GPIO_0_I2C1_SDA<<8 | MUX_LP_GPIO_0_MEGAMUX )
#define PINMUX_LP_GPIO_0_M_I2C0_SDA               ( PIN_LP_GPIO_0<<16 | MEGAMUX_LP_GPIO_0_I2C0_SDA<<8 | MUX_LP_GPIO_0_MEGAMUX )
#define PINMUX_LP_GPIO_0_M_COEX_BLE_SYNC          ( PIN_LP_GPIO_0<<16 | MEGAMUX_LP_GPIO_0_COEX_BLE_SYNC<<8 | MUX_LP_GPIO_0_MEGAMUX )
#define PINMUX_LP_GPIO_0_M_QUAD_DEC2_A            ( PIN_LP_GPIO_0<<16 | MEGAMUX_LP_GPIO_0_QUAD_DEC2_A<<8 | MUX_LP_GPIO_0_MEGAMUX )
#define PINMUX_LP_GPIO_0_M_QUAD_DEC2_B            ( PIN_LP_GPIO_0<<16 | MEGAMUX_LP_GPIO_0_QUAD_DEC2_B<<8 | MUX_LP_GPIO_0_MEGAMUX )
#define PINMUX_LP_GPIO_0_M_COEX_BLE_RX            ( PIN_LP_GPIO_0<<16 | MEGAMUX_LP_GPIO_0_COEX_BLE_RX<<8 | MUX_LP_GPIO_0_MEGAMUX )
#define PINMUX_LP_GPIO_0_M_QUAD_DEC1_B            ( PIN_LP_GPIO_0<<16 | MEGAMUX_LP_GPIO_0_QUAD_DEC1_B<<8 | MUX_LP_GPIO_0_MEGAMUX )
#define PINMUX_LP_GPIO_0_M_PWM3_OUT               ( PIN_LP_GPIO_0<<16 | MEGAMUX_LP_GPIO_0_PWM3_OUT<<8 | MUX_LP_GPIO_0_MEGAMUX )
#define PINMUX_LP_GPIO_0_M_COEX_BLE_RXNTX         ( PIN_LP_GPIO_0<<16 | MEGAMUX_LP_GPIO_0_COEX_BLE_RXNTX<<8 | MUX_LP_GPIO_0_MEGAMUX )
#define PINMUX_LP_GPIO_0_M_QUAD_DEC0_A            ( PIN_LP_GPIO_0<<16 | MEGAMUX_LP_GPIO_0_QUAD_DEC0_A<<8 | MUX_LP_GPIO_0_MEGAMUX )
#define PINMUX_LP_GPIO_0_M_PWM0_OUT               ( PIN_LP_GPIO_0<<16 | MEGAMUX_LP_GPIO_0_PWM0_OUT<<8 | MUX_LP_GPIO_0_MEGAMUX )
#define PINMUX_LP_GPIO_0_M_QUAD_DEC1_A            ( PIN_LP_GPIO_0<<16 | MEGAMUX_LP_GPIO_0_QUAD_DEC1_A<<8 | MUX_LP_GPIO_0_MEGAMUX )
#define PINMUX_LP_GPIO_0_M_PWM2_OUT               ( PIN_LP_GPIO_0<<16 | MEGAMUX_LP_GPIO_0_PWM2_OUT<<8 | MUX_LP_GPIO_0_MEGAMUX )
#define PINMUX_LP_GPIO_0_SWD_CLK                  ( PIN_LP_GPIO_0<<16 | MUX_LP_GPIO_0_SWD_CLK )
#define PINMUX_LP_GPIO_0_TEST_OUT_0               ( PIN_LP_GPIO_0<<16 | MUX_LP_GPIO_0_TEST_OUT_0 )
/* PinMux macros for LP_GPIO_1 */
#define PINMUX_LP_GPIO_1_GPIO                     ( PIN_LP_GPIO_1<<16 | MUX_LP_GPIO_1_GPIO )
#define PINMUX_LP_GPIO_1_SWD_IO                   ( PIN_LP_GPIO_1<<16 | MUX_LP_GPIO_1_SWD_IO )
#define PINMUX_LP_GPIO_1_M_I2C0_SCL               ( PIN_LP_GPIO_1<<16 | MEGAMUX_LP_GPIO_1_I2C0_SCL<<8 | MUX_LP_GPIO_1_MEGAMUX )
#define PINMUX_LP_GPIO_1_M_UART1_CTS              ( PIN_LP_GPIO_1<<16 | MEGAMUX_LP_GPIO_1_UART1_CTS<<8 | MUX_LP_GPIO_1_MEGAMUX )
#define PINMUX_LP_GPIO_1_M_COEX_BLE_MBSY          ( PIN_LP_GPIO_1<<16 | MEGAMUX_LP_GPIO_1_COEX_BLE_MBSY<<8 | MUX_LP_GPIO_1_MEGAMUX )
#define PINMUX_LP_GPIO_1_M_COEX_BLE_TX            ( PIN_LP_GPIO_1<<16 | MEGAMUX_LP_GPIO_1_COEX_BLE_TX<<8 | MUX_LP_GPIO_1_MEGAMUX )
#define PINMUX_LP_GPIO_1_M_UART0_RTS              ( PIN_LP_GPIO_1<<16 | MEGAMUX_LP_GPIO_1_UART0_RTS<<8 | MUX_LP_GPIO_1_MEGAMUX )
#define PINMUX_LP_GPIO_1_M_UART0_RXD              ( PIN_LP_GPIO_1<<16 | MEGAMUX_LP_GPIO_1_UART0_RXD<<8 | MUX_LP_GPIO_1_MEGAMUX )
#define PINMUX_LP_GPIO_1_M_32KHZ_CLK              ( PIN_LP_GPIO_1<<16 | MEGAMUX_LP_GPIO_1_32KHZ_CLK<<8 | MUX_LP_GPIO_1_MEGAMUX )
#define PINMUX_LP_GPIO_1_M_COEX_BLE_IN_PROCESS    ( PIN_LP_GPIO_1<<16 | MEGAMUX_LP_GPIO_1_COEX_BLE_IN_PROCESS<<8 | MUX_LP_GPIO_1_MEGAMUX )
#define PINMUX_LP_GPIO_1_M_UART0_TXD              ( PIN_LP_GPIO_1<<16 | MEGAMUX_LP_GPIO_1_UART0_TXD<<8 | MUX_LP_GPIO_1_MEGAMUX )
#define PINMUX_LP_GPIO_1_M_UART1_TXD              ( PIN_LP_GPIO_1<<16 | MEGAMUX_LP_GPIO_1_UART1_TXD<<8 | MUX_LP_GPIO_1_MEGAMUX )
#define PINMUX_LP_GPIO_1_M_I2C1_SCL               ( PIN_LP_GPIO_1<<16 | MEGAMUX_LP_GPIO_1_I2C1_SCL<<8 | MUX_LP_GPIO_1_MEGAMUX )
#define PINMUX_LP_GPIO_1_M_COEX_WLAN_RX           ( PIN_LP_GPIO_1<<16 | MEGAMUX_LP_GPIO_1_COEX_WLAN_RX<<8 | MUX_LP_GPIO_1_MEGAMUX )
#define PINMUX_LP_GPIO_1_M_COEX_WLAN_TX           ( PIN_LP_GPIO_1<<16 | MEGAMUX_LP_GPIO_1_COEX_WLAN_TX<<8 | MUX_LP_GPIO_1_MEGAMUX )
#define PINMUX_LP_GPIO_1_M_PWM1_OUT               ( PIN_LP_GPIO_1<<16 | MEGAMUX_LP_GPIO_1_PWM1_OUT<<8 | MUX_LP_GPIO_1_MEGAMUX )
#define PINMUX_LP_GPIO_1_M_QUAD_DEC0_B            ( PIN_LP_GPIO_1<<16 | MEGAMUX_LP_GPIO_1_QUAD_DEC0_B<<8 | MUX_LP_GPIO_1_MEGAMUX )
#define PINMUX_LP_GPIO_1_M_UART1_RTS              ( PIN_LP_GPIO_1<<16 | MEGAMUX_LP_GPIO_1_UART1_RTS<<8 | MUX_LP_GPIO_1_MEGAMUX )
#define PINMUX_LP_GPIO_1_M_UART0_CTS              ( PIN_LP_GPIO_1<<16 | MEGAMUX_LP_GPIO_1_UART0_CTS<<8 | MUX_LP_GPIO_1_MEGAMUX )
#define PINMUX_LP_GPIO_1_M_UART1_RXD              ( PIN_LP_GPIO_1<<16 | MEGAMUX_LP_GPIO_1_UART1_RXD<<8 | MUX_LP_GPIO_1_MEGAMUX )
#define PINMUX_LP_GPIO_1_M_COEX_BLE_PTI_0         ( PIN_LP_GPIO_1<<16 | MEGAMUX_LP_GPIO_1_COEX_BLE_PTI_0<<8 | MUX_LP_GPIO_1_MEGAMUX )
#define PINMUX_LP_GPIO_1_M_COEX_BLE_PTI_1         ( PIN_LP_GPIO_1<<16 | MEGAMUX_LP_GPIO_1_COEX_BLE_PTI_1<<8 | MUX_LP_GPIO_1_MEGAMUX )
#define PINMUX_LP_GPIO_1_M_COEX_BLE_PTI_2         ( PIN_LP_GPIO_1<<16 | MEGAMUX_LP_GPIO_1_COEX_BLE_PTI_2<<8 | MUX_LP_GPIO_1_MEGAMUX )
#define PINMUX_LP_GPIO_1_M_COEX_BLE_PTI_3         ( PIN_LP_GPIO_1<<16 | MEGAMUX_LP_GPIO_1_COEX_BLE_PTI_3<<8 | MUX_LP_GPIO_1_MEGAMUX )
#define PINMUX_LP_GPIO_1_M_I2C1_SDA               ( PIN_LP_GPIO_1<<16 | MEGAMUX_LP_GPIO_1_I2C1_SDA<<8 | MUX_LP_GPIO_1_MEGAMUX )
#define PINMUX_LP_GPIO_1_M_I2C0_SDA               ( PIN_LP_GPIO_1<<16 | MEGAMUX_LP_GPIO_1_I2C0_SDA<<8 | MUX_LP_GPIO_1_MEGAMUX )
#define PINMUX_LP_GPIO_1_M_COEX_BLE_SYNC          ( PIN_LP_GPIO_1<<16 | MEGAMUX_LP_GPIO_1_COEX_BLE_SYNC<<8 | MUX_LP_GPIO_1_MEGAMUX )
#define PINMUX_LP_GPIO_1_M_QUAD_DEC2_A            ( PIN_LP_GPIO_1<<16 | MEGAMUX_LP_GPIO_1_QUAD_DEC2_A<<8 | MUX_LP_GPIO_1_MEGAMUX )
#define PINMUX_LP_GPIO_1_M_QUAD_DEC2_B            ( PIN_LP_GPIO_1<<16 | MEGAMUX_LP_GPIO_1_QUAD_DEC2_B<<8 | MUX_LP_GPIO_1_MEGAMUX )
#define PINMUX_LP_GPIO_1_M_COEX_BLE_RX            ( PIN_LP_GPIO_1<<16 | MEGAMUX_LP_GPIO_1_COEX_BLE_RX<<8 | MUX_LP_GPIO_1_MEGAMUX )
#define PINMUX_LP_GPIO_1_M_QUAD_DEC1_B            ( PIN_LP_GPIO_1<<16 | MEGAMUX_LP_GPIO_1_QUAD_DEC1_B<<8 | MUX_LP_GPIO_1_MEGAMUX )
#define PINMUX_LP_GPIO_1_M_PWM3_OUT               ( PIN_LP_GPIO_1<<16 | MEGAMUX_LP_GPIO_1_PWM3_OUT<<8 | MUX_LP_GPIO_1_MEGAMUX )
#define PINMUX_LP_GPIO_1_M_COEX_BLE_RXNTX         ( PIN_LP_GPIO_1<<16 | MEGAMUX_LP_GPIO_1_COEX_BLE_RXNTX<<8 | MUX_LP_GPIO_1_MEGAMUX )
#define PINMUX_LP_GPIO_1_M_QUAD_DEC0_A            ( PIN_LP_GPIO_1<<16 | MEGAMUX_LP_GPIO_1_QUAD_DEC0_A<<8 | MUX_LP_GPIO_1_MEGAMUX )
#define PINMUX_LP_GPIO_1_M_PWM0_OUT               ( PIN_LP_GPIO_1<<16 | MEGAMUX_LP_GPIO_1_PWM0_OUT<<8 | MUX_LP_GPIO_1_MEGAMUX )
#define PINMUX_LP_GPIO_1_M_QUAD_DEC1_A            ( PIN_LP_GPIO_1<<16 | MEGAMUX_LP_GPIO_1_QUAD_DEC1_A<<8 | MUX_LP_GPIO_1_MEGAMUX )
#define PINMUX_LP_GPIO_1_M_PWM2_OUT               ( PIN_LP_GPIO_1<<16 | MEGAMUX_LP_GPIO_1_PWM2_OUT<<8 | MUX_LP_GPIO_1_MEGAMUX )
#define PINMUX_LP_GPIO_1_TEST_OUT_1               ( PIN_LP_GPIO_1<<16 | MUX_LP_GPIO_1_TEST_OUT_1 )
/* PinMux macros for LP_GPIO_2 */
#define PINMUX_LP_GPIO_2_M_I2C0_SCL               ( PIN_LP_GPIO_2<<16 | MEGAMUX_LP_GPIO_2_I2C0_SCL<<8 | MUX_LP_GPIO_2_MEGAMUX )
#define PINMUX_LP_GPIO_2_M_UART1_CTS              ( PIN_LP_GPIO_2<<16 | MEGAMUX_LP_GPIO_2_UART1_CTS<<8 | MUX_LP_GPIO_2_MEGAMUX )
#define PINMUX_LP_GPIO_2_M_COEX_BLE_MBSY          ( PIN_LP_GPIO_2<<16 | MEGAMUX_LP_GPIO_2_COEX_BLE_MBSY<<8 | MUX_LP_GPIO_2_MEGAMUX )
#define PINMUX_LP_GPIO_2_M_COEX_BLE_TX            ( PIN_LP_GPIO_2<<16 | MEGAMUX_LP_GPIO_2_COEX_BLE_TX<<8 | MUX_LP_GPIO_2_MEGAMUX )
#define PINMUX_LP_GPIO_2_M_UART0_RTS              ( PIN_LP_GPIO_2<<16 | MEGAMUX_LP_GPIO_2_UART0_RTS<<8 | MUX_LP_GPIO_2_MEGAMUX )
#define PINMUX_LP_GPIO_2_M_UART0_RXD              ( PIN_LP_GPIO_2<<16 | MEGAMUX_LP_GPIO_2_UART0_RXD<<8 | MUX_LP_GPIO_2_MEGAMUX )
#define PINMUX_LP_GPIO_2_M_32KHZ_CLK              ( PIN_LP_GPIO_2<<16 | MEGAMUX_LP_GPIO_2_32KHZ_CLK<<8 | MUX_LP_GPIO_2_MEGAMUX )
#define PINMUX_LP_GPIO_2_M_COEX_BLE_IN_PROCESS    ( PIN_LP_GPIO_2<<16 | MEGAMUX_LP_GPIO_2_COEX_BLE_IN_PROCESS<<8 | MUX_LP_GPIO_2_MEGAMUX )
#define PINMUX_LP_GPIO_2_M_UART0_TXD              ( PIN_LP_GPIO_2<<16 | MEGAMUX_LP_GPIO_2_UART0_TXD<<8 | MUX_LP_GPIO_2_MEGAMUX )
#define PINMUX_LP_GPIO_2_M_UART1_TXD              ( PIN_LP_GPIO_2<<16 | MEGAMUX_LP_GPIO_2_UART1_TXD<<8 | MUX_LP_GPIO_2_MEGAMUX )
#define PINMUX_LP_GPIO_2_M_I2C1_SCL               ( PIN_LP_GPIO_2<<16 | MEGAMUX_LP_GPIO_2_I2C1_SCL<<8 | MUX_LP_GPIO_2_MEGAMUX )
#define PINMUX_LP_GPIO_2_M_COEX_WLAN_RX           ( PIN_LP_GPIO_2<<16 | MEGAMUX_LP_GPIO_2_COEX_WLAN_RX<<8 | MUX_LP_GPIO_2_MEGAMUX )
#define PINMUX_LP_GPIO_2_M_COEX_WLAN_TX           ( PIN_LP_GPIO_2<<16 | MEGAMUX_LP_GPIO_2_COEX_WLAN_TX<<8 | MUX_LP_GPIO_2_MEGAMUX )
#define PINMUX_LP_GPIO_2_M_PWM1_OUT               ( PIN_LP_GPIO_2<<16 | MEGAMUX_LP_GPIO_2_PWM1_OUT<<8 | MUX_LP_GPIO_2_MEGAMUX )
#define PINMUX_LP_GPIO_2_M_QUAD_DEC0_B            ( PIN_LP_GPIO_2<<16 | MEGAMUX_LP_GPIO_2_QUAD_DEC0_B<<8 | MUX_LP_GPIO_2_MEGAMUX )
#define PINMUX_LP_GPIO_2_M_UART1_RTS              ( PIN_LP_GPIO_2<<16 | MEGAMUX_LP_GPIO_2_UART1_RTS<<8 | MUX_LP_GPIO_2_MEGAMUX )
#define PINMUX_LP_GPIO_2_M_UART0_CTS              ( PIN_LP_GPIO_2<<16 | MEGAMUX_LP_GPIO_2_UART0_CTS<<8 | MUX_LP_GPIO_2_MEGAMUX )
#define PINMUX_LP_GPIO_2_M_UART1_RXD              ( PIN_LP_GPIO_2<<16 | MEGAMUX_LP_GPIO_2_UART1_RXD<<8 | MUX_LP_GPIO_2_MEGAMUX )
#define PINMUX_LP_GPIO_2_M_COEX_BLE_PTI_0         ( PIN_LP_GPIO_2<<16 | MEGAMUX_LP_GPIO_2_COEX_BLE_PTI_0<<8 | MUX_LP_GPIO_2_MEGAMUX )
#define PINMUX_LP_GPIO_2_M_COEX_BLE_PTI_1         ( PIN_LP_GPIO_2<<16 | MEGAMUX_LP_GPIO_2_COEX_BLE_PTI_1<<8 | MUX_LP_GPIO_2_MEGAMUX )
#define PINMUX_LP_GPIO_2_M_COEX_BLE_PTI_2         ( PIN_LP_GPIO_2<<16 | MEGAMUX_LP_GPIO_2_COEX_BLE_PTI_2<<8 | MUX_LP_GPIO_2_MEGAMUX )
#define PINMUX_LP_GPIO_2_M_COEX_BLE_PTI_3         ( PIN_LP_GPIO_2<<16 | MEGAMUX_LP_GPIO_2_COEX_BLE_PTI_3<<8 | MUX_LP_GPIO_2_MEGAMUX )
#define PINMUX_LP_GPIO_2_M_I2C1_SDA               ( PIN_LP_GPIO_2<<16 | MEGAMUX_LP_GPIO_2_I2C1_SDA<<8 | MUX_LP_GPIO_2_MEGAMUX )
#define PINMUX_LP_GPIO_2_M_I2C0_SDA               ( PIN_LP_GPIO_2<<16 | MEGAMUX_LP_GPIO_2_I2C0_SDA<<8 | MUX_LP_GPIO_2_MEGAMUX )
#define PINMUX_LP_GPIO_2_M_COEX_BLE_SYNC          ( PIN_LP_GPIO_2<<16 | MEGAMUX_LP_GPIO_2_COEX_BLE_SYNC<<8 | MUX_LP_GPIO_2_MEGAMUX )
#define PINMUX_LP_GPIO_2_M_QUAD_DEC2_A            ( PIN_LP_GPIO_2<<16 | MEGAMUX_LP_GPIO_2_QUAD_DEC2_A<<8 | MUX_LP_GPIO_2_MEGAMUX )
#define PINMUX_LP_GPIO_2_M_QUAD_DEC2_B            ( PIN_LP_GPIO_2<<16 | MEGAMUX_LP_GPIO_2_QUAD_DEC2_B<<8 | MUX_LP_GPIO_2_MEGAMUX )
#define PINMUX_LP_GPIO_2_M_COEX_BLE_RX            ( PIN_LP_GPIO_2<<16 | MEGAMUX_LP_GPIO_2_COEX_BLE_RX<<8 | MUX_LP_GPIO_2_MEGAMUX )
#define PINMUX_LP_GPIO_2_M_QUAD_DEC1_B            ( PIN_LP_GPIO_2<<16 | MEGAMUX_LP_GPIO_2_QUAD_DEC1_B<<8 | MUX_LP_GPIO_2_MEGAMUX )
#define PINMUX_LP_GPIO_2_M_PWM3_OUT               ( PIN_LP_GPIO_2<<16 | MEGAMUX_LP_GPIO_2_PWM3_OUT<<8 | MUX_LP_GPIO_2_MEGAMUX )
#define PINMUX_LP_GPIO_2_M_COEX_BLE_RXNTX         ( PIN_LP_GPIO_2<<16 | MEGAMUX_LP_GPIO_2_COEX_BLE_RXNTX<<8 | MUX_LP_GPIO_2_MEGAMUX )
#define PINMUX_LP_GPIO_2_M_QUAD_DEC0_A            ( PIN_LP_GPIO_2<<16 | MEGAMUX_LP_GPIO_2_QUAD_DEC0_A<<8 | MUX_LP_GPIO_2_MEGAMUX )
#define PINMUX_LP_GPIO_2_M_PWM0_OUT               ( PIN_LP_GPIO_2<<16 | MEGAMUX_LP_GPIO_2_PWM0_OUT<<8 | MUX_LP_GPIO_2_MEGAMUX )
#define PINMUX_LP_GPIO_2_M_QUAD_DEC1_A            ( PIN_LP_GPIO_2<<16 | MEGAMUX_LP_GPIO_2_QUAD_DEC1_A<<8 | MUX_LP_GPIO_2_MEGAMUX )
#define PINMUX_LP_GPIO_2_M_PWM2_OUT               ( PIN_LP_GPIO_2<<16 | MEGAMUX_LP_GPIO_2_PWM2_OUT<<8 | MUX_LP_GPIO_2_MEGAMUX )
#define PINMUX_LP_GPIO_2_SPI_FLASH0_SCK           ( PIN_LP_GPIO_2<<16 | MUX_LP_GPIO_2_SPI_FLASH0_SCK )
#define PINMUX_LP_GPIO_2_SPI1_SCK                 ( PIN_LP_GPIO_2<<16 | MUX_LP_GPIO_2_SPI1_SCK )
#define PINMUX_LP_GPIO_2_TEST_OUT_2               ( PIN_LP_GPIO_2<<16 | MUX_LP_GPIO_2_TEST_OUT_2 )
#define PINMUX_LP_GPIO_2_UART0_RXD                ( PIN_LP_GPIO_2<<16 | MUX_LP_GPIO_2_UART0_RXD )
#define PINMUX_LP_GPIO_2_GPIO                     ( PIN_LP_GPIO_2<<16 | MUX_LP_GPIO_2_GPIO )
#define PINMUX_LP_GPIO_2_SPI0_SCK                 ( PIN_LP_GPIO_2<<16 | MUX_LP_GPIO_2_SPI0_SCK )
/* PinMux macros for LP_GPIO_3 */
#define PINMUX_LP_GPIO_3_UART0_TXD                ( PIN_LP_GPIO_3<<16 | MUX_LP_GPIO_3_UART0_TXD )
#define PINMUX_LP_GPIO_3_SPI0_MOSI                ( PIN_LP_GPIO_3<<16 | MUX_LP_GPIO_3_SPI0_MOSI )
#define PINMUX_LP_GPIO_3_M_I2C0_SCL               ( PIN_LP_GPIO_3<<16 | MEGAMUX_LP_GPIO_3_I2C0_SCL<<8 | MUX_LP_GPIO_3_MEGAMUX )
#define PINMUX_LP_GPIO_3_M_UART1_CTS              ( PIN_LP_GPIO_3<<16 | MEGAMUX_LP_GPIO_3_UART1_CTS<<8 | MUX_LP_GPIO_3_MEGAMUX )
#define PINMUX_LP_GPIO_3_M_COEX_BLE_MBSY          ( PIN_LP_GPIO_3<<16 | MEGAMUX_LP_GPIO_3_COEX_BLE_MBSY<<8 | MUX_LP_GPIO_3_MEGAMUX )
#define PINMUX_LP_GPIO_3_M_COEX_BLE_TX            ( PIN_LP_GPIO_3<<16 | MEGAMUX_LP_GPIO_3_COEX_BLE_TX<<8 | MUX_LP_GPIO_3_MEGAMUX )
#define PINMUX_LP_GPIO_3_M_UART0_RTS              ( PIN_LP_GPIO_3<<16 | MEGAMUX_LP_GPIO_3_UART0_RTS<<8 | MUX_LP_GPIO_3_MEGAMUX )
#define PINMUX_LP_GPIO_3_M_UART0_RXD              ( PIN_LP_GPIO_3<<16 | MEGAMUX_LP_GPIO_3_UART0_RXD<<8 | MUX_LP_GPIO_3_MEGAMUX )
#define PINMUX_LP_GPIO_3_M_32KHZ_CLK              ( PIN_LP_GPIO_3<<16 | MEGAMUX_LP_GPIO_3_32KHZ_CLK<<8 | MUX_LP_GPIO_3_MEGAMUX )
#define PINMUX_LP_GPIO_3_M_COEX_BLE_IN_PROCESS    ( PIN_LP_GPIO_3<<16 | MEGAMUX_LP_GPIO_3_COEX_BLE_IN_PROCESS<<8 | MUX_LP_GPIO_3_MEGAMUX )
#define PINMUX_LP_GPIO_3_M_UART0_TXD              ( PIN_LP_GPIO_3<<16 | MEGAMUX_LP_GPIO_3_UART0_TXD<<8 | MUX_LP_GPIO_3_MEGAMUX )
#define PINMUX_LP_GPIO_3_M_UART1_TXD              ( PIN_LP_GPIO_3<<16 | MEGAMUX_LP_GPIO_3_UART1_TXD<<8 | MUX_LP_GPIO_3_MEGAMUX )
#define PINMUX_LP_GPIO_3_M_I2C1_SCL               ( PIN_LP_GPIO_3<<16 | MEGAMUX_LP_GPIO_3_I2C1_SCL<<8 | MUX_LP_GPIO_3_MEGAMUX )
#define PINMUX_LP_GPIO_3_M_COEX_WLAN_RX           ( PIN_LP_GPIO_3<<16 | MEGAMUX_LP_GPIO_3_COEX_WLAN_RX<<8 | MUX_LP_GPIO_3_MEGAMUX )
#define PINMUX_LP_GPIO_3_M_COEX_WLAN_TX           ( PIN_LP_GPIO_3<<16 | MEGAMUX_LP_GPIO_3_COEX_WLAN_TX<<8 | MUX_LP_GPIO_3_MEGAMUX )
#define PINMUX_LP_GPIO_3_M_PWM1_OUT               ( PIN_LP_GPIO_3<<16 | MEGAMUX_LP_GPIO_3_PWM1_OUT<<8 | MUX_LP_GPIO_3_MEGAMUX )
#define PINMUX_LP_GPIO_3_M_QUAD_DEC0_B            ( PIN_LP_GPIO_3<<16 | MEGAMUX_LP_GPIO_3_QUAD_DEC0_B<<8 | MUX_LP_GPIO_3_MEGAMUX )
#define PINMUX_LP_GPIO_3_M_UART1_RTS              ( PIN_LP_GPIO_3<<16 | MEGAMUX_LP_GPIO_3_UART1_RTS<<8 | MUX_LP_GPIO_3_MEGAMUX )
#define PINMUX_LP_GPIO_3_M_UART0_CTS              ( PIN_LP_GPIO_3<<16 | MEGAMUX_LP_GPIO_3_UART0_CTS<<8 | MUX_LP_GPIO_3_MEGAMUX )
#define PINMUX_LP_GPIO_3_M_UART1_RXD              ( PIN_LP_GPIO_3<<16 | MEGAMUX_LP_GPIO_3_UART1_RXD<<8 | MUX_LP_GPIO_3_MEGAMUX )
#define PINMUX_LP_GPIO_3_M_COEX_BLE_PTI_0         ( PIN_LP_GPIO_3<<16 | MEGAMUX_LP_GPIO_3_COEX_BLE_PTI_0<<8 | MUX_LP_GPIO_3_MEGAMUX )
#define PINMUX_LP_GPIO_3_M_COEX_BLE_PTI_1         ( PIN_LP_GPIO_3<<16 | MEGAMUX_LP_GPIO_3_COEX_BLE_PTI_1<<8 | MUX_LP_GPIO_3_MEGAMUX )
#define PINMUX_LP_GPIO_3_M_COEX_BLE_PTI_2         ( PIN_LP_GPIO_3<<16 | MEGAMUX_LP_GPIO_3_COEX_BLE_PTI_2<<8 | MUX_LP_GPIO_3_MEGAMUX )
#define PINMUX_LP_GPIO_3_M_COEX_BLE_PTI_3         ( PIN_LP_GPIO_3<<16 | MEGAMUX_LP_GPIO_3_COEX_BLE_PTI_3<<8 | MUX_LP_GPIO_3_MEGAMUX )
#define PINMUX_LP_GPIO_3_M_I2C1_SDA               ( PIN_LP_GPIO_3<<16 | MEGAMUX_LP_GPIO_3_I2C1_SDA<<8 | MUX_LP_GPIO_3_MEGAMUX )
#define PINMUX_LP_GPIO_3_M_I2C0_SDA               ( PIN_LP_GPIO_3<<16 | MEGAMUX_LP_GPIO_3_I2C0_SDA<<8 | MUX_LP_GPIO_3_MEGAMUX )
#define PINMUX_LP_GPIO_3_M_COEX_BLE_SYNC          ( PIN_LP_GPIO_3<<16 | MEGAMUX_LP_GPIO_3_COEX_BLE_SYNC<<8 | MUX_LP_GPIO_3_MEGAMUX )
#define PINMUX_LP_GPIO_3_M_QUAD_DEC2_A            ( PIN_LP_GPIO_3<<16 | MEGAMUX_LP_GPIO_3_QUAD_DEC2_A<<8 | MUX_LP_GPIO_3_MEGAMUX )
#define PINMUX_LP_GPIO_3_M_QUAD_DEC2_B            ( PIN_LP_GPIO_3<<16 | MEGAMUX_LP_GPIO_3_QUAD_DEC2_B<<8 | MUX_LP_GPIO_3_MEGAMUX )
#define PINMUX_LP_GPIO_3_M_COEX_BLE_RX            ( PIN_LP_GPIO_3<<16 | MEGAMUX_LP_GPIO_3_COEX_BLE_RX<<8 | MUX_LP_GPIO_3_MEGAMUX )
#define PINMUX_LP_GPIO_3_M_QUAD_DEC1_B            ( PIN_LP_GPIO_3<<16 | MEGAMUX_LP_GPIO_3_QUAD_DEC1_B<<8 | MUX_LP_GPIO_3_MEGAMUX )
#define PINMUX_LP_GPIO_3_M_PWM3_OUT               ( PIN_LP_GPIO_3<<16 | MEGAMUX_LP_GPIO_3_PWM3_OUT<<8 | MUX_LP_GPIO_3_MEGAMUX )
#define PINMUX_LP_GPIO_3_M_COEX_BLE_RXNTX         ( PIN_LP_GPIO_3<<16 | MEGAMUX_LP_GPIO_3_COEX_BLE_RXNTX<<8 | MUX_LP_GPIO_3_MEGAMUX )
#define PINMUX_LP_GPIO_3_M_QUAD_DEC0_A            ( PIN_LP_GPIO_3<<16 | MEGAMUX_LP_GPIO_3_QUAD_DEC0_A<<8 | MUX_LP_GPIO_3_MEGAMUX )
#define PINMUX_LP_GPIO_3_M_PWM0_OUT               ( PIN_LP_GPIO_3<<16 | MEGAMUX_LP_GPIO_3_PWM0_OUT<<8 | MUX_LP_GPIO_3_MEGAMUX )
#define PINMUX_LP_GPIO_3_M_QUAD_DEC1_A            ( PIN_LP_GPIO_3<<16 | MEGAMUX_LP_GPIO_3_QUAD_DEC1_A<<8 | MUX_LP_GPIO_3_MEGAMUX )
#define PINMUX_LP_GPIO_3_M_PWM2_OUT               ( PIN_LP_GPIO_3<<16 | MEGAMUX_LP_GPIO_3_PWM2_OUT<<8 | MUX_LP_GPIO_3_MEGAMUX )
#define PINMUX_LP_GPIO_3_SPI1_MOSI                ( PIN_LP_GPIO_3<<16 | MUX_LP_GPIO_3_SPI1_MOSI )
#define PINMUX_LP_GPIO_3_SPI_FLASH0_TXD           ( PIN_LP_GPIO_3<<16 | MUX_LP_GPIO_3_SPI_FLASH0_TXD )
#define PINMUX_LP_GPIO_3_TEST_OUT_3               ( PIN_LP_GPIO_3<<16 | MUX_LP_GPIO_3_TEST_OUT_3 )
#define PINMUX_LP_GPIO_3_GPIO                     ( PIN_LP_GPIO_3<<16 | MUX_LP_GPIO_3_GPIO )
/* PinMux macros for LP_GPIO_4 */
#define PINMUX_LP_GPIO_4_M_I2C0_SCL               ( PIN_LP_GPIO_4<<16 | MEGAMUX_LP_GPIO_4_I2C0_SCL<<8 | MUX_LP_GPIO_4_MEGAMUX )
#define PINMUX_LP_GPIO_4_M_UART1_CTS              ( PIN_LP_GPIO_4<<16 | MEGAMUX_LP_GPIO_4_UART1_CTS<<8 | MUX_LP_GPIO_4_MEGAMUX )
#define PINMUX_LP_GPIO_4_M_COEX_BLE_MBSY          ( PIN_LP_GPIO_4<<16 | MEGAMUX_LP_GPIO_4_COEX_BLE_MBSY<<8 | MUX_LP_GPIO_4_MEGAMUX )
#define PINMUX_LP_GPIO_4_M_COEX_BLE_TX            ( PIN_LP_GPIO_4<<16 | MEGAMUX_LP_GPIO_4_COEX_BLE_TX<<8 | MUX_LP_GPIO_4_MEGAMUX )
#define PINMUX_LP_GPIO_4_M_UART0_RTS              ( PIN_LP_GPIO_4<<16 | MEGAMUX_LP_GPIO_4_UART0_RTS<<8 | MUX_LP_GPIO_4_MEGAMUX )
#define PINMUX_LP_GPIO_4_M_UART0_RXD              ( PIN_LP_GPIO_4<<16 | MEGAMUX_LP_GPIO_4_UART0_RXD<<8 | MUX_LP_GPIO_4_MEGAMUX )
#define PINMUX_LP_GPIO_4_M_32KHZ_CLK              ( PIN_LP_GPIO_4<<16 | MEGAMUX_LP_GPIO_4_32KHZ_CLK<<8 | MUX_LP_GPIO_4_MEGAMUX )
#define PINMUX_LP_GPIO_4_M_COEX_BLE_IN_PROCESS    ( PIN_LP_GPIO_4<<16 | MEGAMUX_LP_GPIO_4_COEX_BLE_IN_PROCESS<<8 | MUX_LP_GPIO_4_MEGAMUX )
#define PINMUX_LP_GPIO_4_M_UART0_TXD              ( PIN_LP_GPIO_4<<16 | MEGAMUX_LP_GPIO_4_UART0_TXD<<8 | MUX_LP_GPIO_4_MEGAMUX )
#define PINMUX_LP_GPIO_4_M_UART1_TXD              ( PIN_LP_GPIO_4<<16 | MEGAMUX_LP_GPIO_4_UART1_TXD<<8 | MUX_LP_GPIO_4_MEGAMUX )
#define PINMUX_LP_GPIO_4_M_I2C1_SCL               ( PIN_LP_GPIO_4<<16 | MEGAMUX_LP_GPIO_4_I2C1_SCL<<8 | MUX_LP_GPIO_4_MEGAMUX )
#define PINMUX_LP_GPIO_4_M_COEX_WLAN_RX           ( PIN_LP_GPIO_4<<16 | MEGAMUX_LP_GPIO_4_COEX_WLAN_RX<<8 | MUX_LP_GPIO_4_MEGAMUX )
#define PINMUX_LP_GPIO_4_M_COEX_WLAN_TX           ( PIN_LP_GPIO_4<<16 | MEGAMUX_LP_GPIO_4_COEX_WLAN_TX<<8 | MUX_LP_GPIO_4_MEGAMUX )
#define PINMUX_LP_GPIO_4_M_PWM1_OUT               ( PIN_LP_GPIO_4<<16 | MEGAMUX_LP_GPIO_4_PWM1_OUT<<8 | MUX_LP_GPIO_4_MEGAMUX )
#define PINMUX_LP_GPIO_4_M_QUAD_DEC0_B            ( PIN_LP_GPIO_4<<16 | MEGAMUX_LP_GPIO_4_QUAD_DEC0_B<<8 | MUX_LP_GPIO_4_MEGAMUX )
#define PINMUX_LP_GPIO_4_M_UART1_RTS              ( PIN_LP_GPIO_4<<16 | MEGAMUX_LP_GPIO_4_UART1_RTS<<8 | MUX_LP_GPIO_4_MEGAMUX )
#define PINMUX_LP_GPIO_4_M_UART0_CTS              ( PIN_LP_GPIO_4<<16 | MEGAMUX_LP_GPIO_4_UART0_CTS<<8 | MUX_LP_GPIO_4_MEGAMUX )
#define PINMUX_LP_GPIO_4_M_UART1_RXD              ( PIN_LP_GPIO_4<<16 | MEGAMUX_LP_GPIO_4_UART1_RXD<<8 | MUX_LP_GPIO_4_MEGAMUX )
#define PINMUX_LP_GPIO_4_M_COEX_BLE_PTI_0         ( PIN_LP_GPIO_4<<16 | MEGAMUX_LP_GPIO_4_COEX_BLE_PTI_0<<8 | MUX_LP_GPIO_4_MEGAMUX )
#define PINMUX_LP_GPIO_4_M_COEX_BLE_PTI_1         ( PIN_LP_GPIO_4<<16 | MEGAMUX_LP_GPIO_4_COEX_BLE_PTI_1<<8 | MUX_LP_GPIO_4_MEGAMUX )
#define PINMUX_LP_GPIO_4_M_COEX_BLE_PTI_2         ( PIN_LP_GPIO_4<<16 | MEGAMUX_LP_GPIO_4_COEX_BLE_PTI_2<<8 | MUX_LP_GPIO_4_MEGAMUX )
#define PINMUX_LP_GPIO_4_M_COEX_BLE_PTI_3         ( PIN_LP_GPIO_4<<16 | MEGAMUX_LP_GPIO_4_COEX_BLE_PTI_3<<8 | MUX_LP_GPIO_4_MEGAMUX )
#define PINMUX_LP_GPIO_4_M_I2C1_SDA               ( PIN_LP_GPIO_4<<16 | MEGAMUX_LP_GPIO_4_I2C1_SDA<<8 | MUX_LP_GPIO_4_MEGAMUX )
#define PINMUX_LP_GPIO_4_M_I2C0_SDA               ( PIN_LP_GPIO_4<<16 | MEGAMUX_LP_GPIO_4_I2C0_SDA<<8 | MUX_LP_GPIO_4_MEGAMUX )
#define PINMUX_LP_GPIO_4_M_COEX_BLE_SYNC          ( PIN_LP_GPIO_4<<16 | MEGAMUX_LP_GPIO_4_COEX_BLE_SYNC<<8 | MUX_LP_GPIO_4_MEGAMUX )
#define PINMUX_LP_GPIO_4_M_QUAD_DEC2_A            ( PIN_LP_GPIO_4<<16 | MEGAMUX_LP_GPIO_4_QUAD_DEC2_A<<8 | MUX_LP_GPIO_4_MEGAMUX )
#define PINMUX_LP_GPIO_4_M_QUAD_DEC2_B            ( PIN_LP_GPIO_4<<16 | MEGAMUX_LP_GPIO_4_QUAD_DEC2_B<<8 | MUX_LP_GPIO_4_MEGAMUX )
#define PINMUX_LP_GPIO_4_M_COEX_BLE_RX            ( PIN_LP_GPIO_4<<16 | MEGAMUX_LP_GPIO_4_COEX_BLE_RX<<8 | MUX_LP_GPIO_4_MEGAMUX )
