remotemcu/remcu-chip-sdks/SAM/xdk-asf-3.45.0/sam0/utils/cmsis/samb11/include/pio/samb11zr.h
#define PINMUX_LP_GPIO_14_M_I2C0_SCL              ( PIN_LP_GPIO_14<<16 | MEGAMUX_LP_GPIO_14_I2C0_SCL<<8 | MUX_LP_GPIO_14_MEGAMUX )
#define PINMUX_LP_GPIO_14_M_UART1_CTS             ( PIN_LP_GPIO_14<<16 | MEGAMUX_LP_GPIO_14_UART1_CTS<<8 | MUX_LP_GPIO_14_MEGAMUX )
#define PINMUX_LP_GPIO_14_M_COEX_BLE_MBSY         ( PIN_LP_GPIO_14<<16 | MEGAMUX_LP_GPIO_14_COEX_BLE_MBSY<<8 | MUX_LP_GPIO_14_MEGAMUX )
#define PINMUX_LP_GPIO_14_M_COEX_BLE_TX           ( PIN_LP_GPIO_14<<16 | MEGAMUX_LP_GPIO_14_COEX_BLE_TX<<8 | MUX_LP_GPIO_14_MEGAMUX )
#define PINMUX_LP_GPIO_14_M_UART0_RTS             ( PIN_LP_GPIO_14<<16 | MEGAMUX_LP_GPIO_14_UART0_RTS<<8 | MUX_LP_GPIO_14_MEGAMUX )
#define PINMUX_LP_GPIO_14_M_UART0_RXD             ( PIN_LP_GPIO_14<<16 | MEGAMUX_LP_GPIO_14_UART0_RXD<<8 | MUX_LP_GPIO_14_MEGAMUX )
#define PINMUX_LP_GPIO_14_M_32KHZ_CLK             ( PIN_LP_GPIO_14<<16 | MEGAMUX_LP_GPIO_14_32KHZ_CLK<<8 | MUX_LP_GPIO_14_MEGAMUX )
#define PINMUX_LP_GPIO_14_M_COEX_BLE_IN_PROCESS   ( PIN_LP_GPIO_14<<16 | MEGAMUX_LP_GPIO_14_COEX_BLE_IN_PROCESS<<8 | MUX_LP_GPIO_14_MEGAMUX )
#define PINMUX_LP_GPIO_14_M_UART0_TXD             ( PIN_LP_GPIO_14<<16 | MEGAMUX_LP_GPIO_14_UART0_TXD<<8 | MUX_LP_GPIO_14_MEGAMUX )
#define PINMUX_LP_GPIO_14_M_UART1_TXD             ( PIN_LP_GPIO_14<<16 | MEGAMUX_LP_GPIO_14_UART1_TXD<<8 | MUX_LP_GPIO_14_MEGAMUX )
#define PINMUX_LP_GPIO_14_M_I2C1_SCL              ( PIN_LP_GPIO_14<<16 | MEGAMUX_LP_GPIO_14_I2C1_SCL<<8 | MUX_LP_GPIO_14_MEGAMUX )
#define PINMUX_LP_GPIO_14_M_COEX_WLAN_RX          ( PIN_LP_GPIO_14<<16 | MEGAMUX_LP_GPIO_14_COEX_WLAN_RX<<8 | MUX_LP_GPIO_14_MEGAMUX )
#define PINMUX_LP_GPIO_14_M_COEX_WLAN_TX          ( PIN_LP_GPIO_14<<16 | MEGAMUX_LP_GPIO_14_COEX_WLAN_TX<<8 | MUX_LP_GPIO_14_MEGAMUX )
#define PINMUX_LP_GPIO_14_M_PWM1_OUT              ( PIN_LP_GPIO_14<<16 | MEGAMUX_LP_GPIO_14_PWM1_OUT<<8 | MUX_LP_GPIO_14_MEGAMUX )
#define PINMUX_LP_GPIO_14_M_QUAD_DEC0_B           ( PIN_LP_GPIO_14<<16 | MEGAMUX_LP_GPIO_14_QUAD_DEC0_B<<8 | MUX_LP_GPIO_14_MEGAMUX )
#define PINMUX_LP_GPIO_14_M_UART1_RTS             ( PIN_LP_GPIO_14<<16 | MEGAMUX_LP_GPIO_14_UART1_RTS<<8 | MUX_LP_GPIO_14_MEGAMUX )
#define PINMUX_LP_GPIO_14_M_UART0_CTS             ( PIN_LP_GPIO_14<<16 | MEGAMUX_LP_GPIO_14_UART0_CTS<<8 | MUX_LP_GPIO_14_MEGAMUX )
#define PINMUX_LP_GPIO_14_M_UART1_RXD             ( PIN_LP_GPIO_14<<16 | MEGAMUX_LP_GPIO_14_UART1_RXD<<8 | MUX_LP_GPIO_14_MEGAMUX )
#define PINMUX_LP_GPIO_14_M_COEX_BLE_PTI_0        ( PIN_LP_GPIO_14<<16 | MEGAMUX_LP_GPIO_14_COEX_BLE_PTI_0<<8 | MUX_LP_GPIO_14_MEGAMUX )
#define PINMUX_LP_GPIO_14_M_COEX_BLE_PTI_1        ( PIN_LP_GPIO_14<<16 | MEGAMUX_LP_GPIO_14_COEX_BLE_PTI_1<<8 | MUX_LP_GPIO_14_MEGAMUX )
#define PINMUX_LP_GPIO_14_M_COEX_BLE_PTI_2        ( PIN_LP_GPIO_14<<16 | MEGAMUX_LP_GPIO_14_COEX_BLE_PTI_2<<8 | MUX_LP_GPIO_14_MEGAMUX )
#define PINMUX_LP_GPIO_14_M_COEX_BLE_PTI_3        ( PIN_LP_GPIO_14<<16 | MEGAMUX_LP_GPIO_14_COEX_BLE_PTI_3<<8 | MUX_LP_GPIO_14_MEGAMUX )
#define PINMUX_LP_GPIO_14_M_I2C1_SDA              ( PIN_LP_GPIO_14<<16 | MEGAMUX_LP_GPIO_14_I2C1_SDA<<8 | MUX_LP_GPIO_14_MEGAMUX )
#define PINMUX_LP_GPIO_14_M_I2C0_SDA              ( PIN_LP_GPIO_14<<16 | MEGAMUX_LP_GPIO_14_I2C0_SDA<<8 | MUX_LP_GPIO_14_MEGAMUX )
#define PINMUX_LP_GPIO_14_M_COEX_BLE_SYNC         ( PIN_LP_GPIO_14<<16 | MEGAMUX_LP_GPIO_14_COEX_BLE_SYNC<<8 | MUX_LP_GPIO_14_MEGAMUX )
#define PINMUX_LP_GPIO_14_M_QUAD_DEC2_A           ( PIN_LP_GPIO_14<<16 | MEGAMUX_LP_GPIO_14_QUAD_DEC2_A<<8 | MUX_LP_GPIO_14_MEGAMUX )
#define PINMUX_LP_GPIO_14_M_QUAD_DEC2_B           ( PIN_LP_GPIO_14<<16 | MEGAMUX_LP_GPIO_14_QUAD_DEC2_B<<8 | MUX_LP_GPIO_14_MEGAMUX )
#define PINMUX_LP_GPIO_14_M_COEX_BLE_RX           ( PIN_LP_GPIO_14<<16 | MEGAMUX_LP_GPIO_14_COEX_BLE_RX<<8 | MUX_LP_GPIO_14_MEGAMUX )
#define PINMUX_LP_GPIO_14_M_QUAD_DEC1_B           ( PIN_LP_GPIO_14<<16 | MEGAMUX_LP_GPIO_14_QUAD_DEC1_B<<8 | MUX_LP_GPIO_14_MEGAMUX )
#define PINMUX_LP_GPIO_14_M_PWM3_OUT              ( PIN_LP_GPIO_14<<16 | MEGAMUX_LP_GPIO_14_PWM3_OUT<<8 | MUX_LP_GPIO_14_MEGAMUX )
#define PINMUX_LP_GPIO_14_M_COEX_BLE_RXNTX        ( PIN_LP_GPIO_14<<16 | MEGAMUX_LP_GPIO_14_COEX_BLE_RXNTX<<8 | MUX_LP_GPIO_14_MEGAMUX )
#define PINMUX_LP_GPIO_14_M_QUAD_DEC0_A           ( PIN_LP_GPIO_14<<16 | MEGAMUX_LP_GPIO_14_QUAD_DEC0_A<<8 | MUX_LP_GPIO_14_MEGAMUX )
#define PINMUX_LP_GPIO_14_M_PWM0_OUT              ( PIN_LP_GPIO_14<<16 | MEGAMUX_LP_GPIO_14_PWM0_OUT<<8 | MUX_LP_GPIO_14_MEGAMUX )
#define PINMUX_LP_GPIO_14_M_QUAD_DEC1_A           ( PIN_LP_GPIO_14<<16 | MEGAMUX_LP_GPIO_14_QUAD_DEC1_A<<8 | MUX_LP_GPIO_14_MEGAMUX )
#define PINMUX_LP_GPIO_14_M_PWM2_OUT              ( PIN_LP_GPIO_14<<16 | MEGAMUX_LP_GPIO_14_PWM2_OUT<<8 | MUX_LP_GPIO_14_MEGAMUX )
#define PINMUX_LP_GPIO_14_UART1_CTS               ( PIN_LP_GPIO_14<<16 | MUX_LP_GPIO_14_UART1_CTS )
/* PinMux macros for LP_GPIO_15 */
#define PINMUX_LP_GPIO_15_GPIO                    ( PIN_LP_GPIO_15<<16 | MUX_LP_GPIO_15_GPIO )
#define PINMUX_LP_GPIO_15_M_I2C0_SCL              ( PIN_LP_GPIO_15<<16 | MEGAMUX_LP_GPIO_15_I2C0_SCL<<8 | MUX_LP_GPIO_15_MEGAMUX )
#define PINMUX_LP_GPIO_15_M_UART1_CTS             ( PIN_LP_GPIO_15<<16 | MEGAMUX_LP_GPIO_15_UART1_CTS<<8 | MUX_LP_GPIO_15_MEGAMUX )
#define PINMUX_LP_GPIO_15_M_COEX_BLE_MBSY         ( PIN_LP_GPIO_15<<16 | MEGAMUX_LP_GPIO_15_COEX_BLE_MBSY<<8 | MUX_LP_GPIO_15_MEGAMUX )
#define PINMUX_LP_GPIO_15_M_COEX_BLE_TX           ( PIN_LP_GPIO_15<<16 | MEGAMUX_LP_GPIO_15_COEX_BLE_TX<<8 | MUX_LP_GPIO_15_MEGAMUX )
#define PINMUX_LP_GPIO_15_M_UART0_RTS             ( PIN_LP_GPIO_15<<16 | MEGAMUX_LP_GPIO_15_UART0_RTS<<8 | MUX_LP_GPIO_15_MEGAMUX )
#define PINMUX_LP_GPIO_15_M_UART0_RXD             ( PIN_LP_GPIO_15<<16 | MEGAMUX_LP_GPIO_15_UART0_RXD<<8 | MUX_LP_GPIO_15_MEGAMUX )
#define PINMUX_LP_GPIO_15_M_32KHZ_CLK             ( PIN_LP_GPIO_15<<16 | MEGAMUX_LP_GPIO_15_32KHZ_CLK<<8 | MUX_LP_GPIO_15_MEGAMUX )
#define PINMUX_LP_GPIO_15_M_COEX_BLE_IN_PROCESS   ( PIN_LP_GPIO_15<<16 | MEGAMUX_LP_GPIO_15_COEX_BLE_IN_PROCESS<<8 | MUX_LP_GPIO_15_MEGAMUX )
#define PINMUX_LP_GPIO_15_M_UART0_TXD             ( PIN_LP_GPIO_15<<16 | MEGAMUX_LP_GPIO_15_UART0_TXD<<8 | MUX_LP_GPIO_15_MEGAMUX )
#define PINMUX_LP_GPIO_15_M_UART1_TXD             ( PIN_LP_GPIO_15<<16 | MEGAMUX_LP_GPIO_15_UART1_TXD<<8 | MUX_LP_GPIO_15_MEGAMUX )
#define PINMUX_LP_GPIO_15_M_I2C1_SCL              ( PIN_LP_GPIO_15<<16 | MEGAMUX_LP_GPIO_15_I2C1_SCL<<8 | MUX_LP_GPIO_15_MEGAMUX )
#define PINMUX_LP_GPIO_15_M_COEX_WLAN_RX          ( PIN_LP_GPIO_15<<16 | MEGAMUX_LP_GPIO_15_COEX_WLAN_RX<<8 | MUX_LP_GPIO_15_MEGAMUX )
#define PINMUX_LP_GPIO_15_M_COEX_WLAN_TX          ( PIN_LP_GPIO_15<<16 | MEGAMUX_LP_GPIO_15_COEX_WLAN_TX<<8 | MUX_LP_GPIO_15_MEGAMUX )
#define PINMUX_LP_GPIO_15_M_PWM1_OUT              ( PIN_LP_GPIO_15<<16 | MEGAMUX_LP_GPIO_15_PWM1_OUT<<8 | MUX_LP_GPIO_15_MEGAMUX )
#define PINMUX_LP_GPIO_15_M_QUAD_DEC0_B           ( PIN_LP_GPIO_15<<16 | MEGAMUX_LP_GPIO_15_QUAD_DEC0_B<<8 | MUX_LP_GPIO_15_MEGAMUX )
#define PINMUX_LP_GPIO_15_M_UART1_RTS             ( PIN_LP_GPIO_15<<16 | MEGAMUX_LP_GPIO_15_UART1_RTS<<8 | MUX_LP_GPIO_15_MEGAMUX )
#define PINMUX_LP_GPIO_15_M_UART0_CTS             ( PIN_LP_GPIO_15<<16 | MEGAMUX_LP_GPIO_15_UART0_CTS<<8 | MUX_LP_GPIO_15_MEGAMUX )
#define PINMUX_LP_GPIO_15_M_UART1_RXD             ( PIN_LP_GPIO_15<<16 | MEGAMUX_LP_GPIO_15_UART1_RXD<<8 | MUX_LP_GPIO_15_MEGAMUX )
#define PINMUX_LP_GPIO_15_M_COEX_BLE_PTI_0        ( PIN_LP_GPIO_15<<16 | MEGAMUX_LP_GPIO_15_COEX_BLE_PTI_0<<8 | MUX_LP_GPIO_15_MEGAMUX )
#define PINMUX_LP_GPIO_15_M_COEX_BLE_PTI_1        ( PIN_LP_GPIO_15<<16 | MEGAMUX_LP_GPIO_15_COEX_BLE_PTI_1<<8 | MUX_LP_GPIO_15_MEGAMUX )
#define PINMUX_LP_GPIO_15_M_COEX_BLE_PTI_2        ( PIN_LP_GPIO_15<<16 | MEGAMUX_LP_GPIO_15_COEX_BLE_PTI_2<<8 | MUX_LP_GPIO_15_MEGAMUX )
#define PINMUX_LP_GPIO_15_M_COEX_BLE_PTI_3        ( PIN_LP_GPIO_15<<16 | MEGAMUX_LP_GPIO_15_COEX_BLE_PTI_3<<8 | MUX_LP_GPIO_15_MEGAMUX )
#define PINMUX_LP_GPIO_15_M_I2C1_SDA              ( PIN_LP_GPIO_15<<16 | MEGAMUX_LP_GPIO_15_I2C1_SDA<<8 | MUX_LP_GPIO_15_MEGAMUX )
#define PINMUX_LP_GPIO_15_M_I2C0_SDA              ( PIN_LP_GPIO_15<<16 | MEGAMUX_LP_GPIO_15_I2C0_SDA<<8 | MUX_LP_GPIO_15_MEGAMUX )
#define PINMUX_LP_GPIO_15_M_COEX_BLE_SYNC         ( PIN_LP_GPIO_15<<16 | MEGAMUX_LP_GPIO_15_COEX_BLE_SYNC<<8 | MUX_LP_GPIO_15_MEGAMUX )
#define PINMUX_LP_GPIO_15_M_QUAD_DEC2_A           ( PIN_LP_GPIO_15<<16 | MEGAMUX_LP_GPIO_15_QUAD_DEC2_A<<8 | MUX_LP_GPIO_15_MEGAMUX )
#define PINMUX_LP_GPIO_15_M_QUAD_DEC2_B           ( PIN_LP_GPIO_15<<16 | MEGAMUX_LP_GPIO_15_QUAD_DEC2_B<<8 | MUX_LP_GPIO_15_MEGAMUX )
#define PINMUX_LP_GPIO_15_M_COEX_BLE_RX           ( PIN_LP_GPIO_15<<16 | MEGAMUX_LP_GPIO_15_COEX_BLE_RX<<8 | MUX_LP_GPIO_15_MEGAMUX )
#define PINMUX_LP_GPIO_15_M_QUAD_DEC1_B           ( PIN_LP_GPIO_15<<16 | MEGAMUX_LP_GPIO_15_QUAD_DEC1_B<<8 | MUX_LP_GPIO_15_MEGAMUX )
#define PINMUX_LP_GPIO_15_M_PWM3_OUT              ( PIN_LP_GPIO_15<<16 | MEGAMUX_LP_GPIO_15_PWM3_OUT<<8 | MUX_LP_GPIO_15_MEGAMUX )
#define PINMUX_LP_GPIO_15_M_COEX_BLE_RXNTX        ( PIN_LP_GPIO_15<<16 | MEGAMUX_LP_GPIO_15_COEX_BLE_RXNTX<<8 | MUX_LP_GPIO_15_MEGAMUX )
#define PINMUX_LP_GPIO_15_M_QUAD_DEC0_A           ( PIN_LP_GPIO_15<<16 | MEGAMUX_LP_GPIO_15_QUAD_DEC0_A<<8 | MUX_LP_GPIO_15_MEGAMUX )
#define PINMUX_LP_GPIO_15_M_PWM0_OUT              ( PIN_LP_GPIO_15<<16 | MEGAMUX_LP_GPIO_15_PWM0_OUT<<8 | MUX_LP_GPIO_15_MEGAMUX )
#define PINMUX_LP_GPIO_15_M_QUAD_DEC1_A           ( PIN_LP_GPIO_15<<16 | MEGAMUX_LP_GPIO_15_QUAD_DEC1_A<<8 | MUX_LP_GPIO_15_MEGAMUX )
#define PINMUX_LP_GPIO_15_M_PWM2_OUT              ( PIN_LP_GPIO_15<<16 | MEGAMUX_LP_GPIO_15_PWM2_OUT<<8 | MUX_LP_GPIO_15_MEGAMUX )
#define PINMUX_LP_GPIO_15_UART1_RTS               ( PIN_LP_GPIO_15<<16 | MUX_LP_GPIO_15_UART1_RTS )
#define PINMUX_LP_GPIO_15_I2C1_SCL                ( PIN_LP_GPIO_15<<16 | MUX_LP_GPIO_15_I2C1_SCL )
#define PINMUX_LP_GPIO_15_TEST_OUT_15             ( PIN_LP_GPIO_15<<16 | MUX_LP_GPIO_15_TEST_OUT_15 )
/* PinMux macros for LP_GPIO_16 */
#define PINMUX_LP_GPIO_16_M_I2C0_SCL              ( PIN_LP_GPIO_16<<16 | MEGAMUX_LP_GPIO_16_I2C0_SCL<<8 | MUX_LP_GPIO_16_MEGAMUX )
#define PINMUX_LP_GPIO_16_M_UART1_CTS             ( PIN_LP_GPIO_16<<16 | MEGAMUX_LP_GPIO_16_UART1_CTS<<8 | MUX_LP_GPIO_16_MEGAMUX )
#define PINMUX_LP_GPIO_16_M_COEX_BLE_MBSY         ( PIN_LP_GPIO_16<<16 | MEGAMUX_LP_GPIO_16_COEX_BLE_MBSY<<8 | MUX_LP_GPIO_16_MEGAMUX )
#define PINMUX_LP_GPIO_16_M_COEX_BLE_TX           ( PIN_LP_GPIO_16<<16 | MEGAMUX_LP_GPIO_16_COEX_BLE_TX<<8 | MUX_LP_GPIO_16_MEGAMUX )
#define PINMUX_LP_GPIO_16_M_UART0_RTS             ( PIN_LP_GPIO_16<<16 | MEGAMUX_LP_GPIO_16_UART0_RTS<<8 | MUX_LP_GPIO_16_MEGAMUX )
#define PINMUX_LP_GPIO_16_M_UART0_RXD             ( PIN_LP_GPIO_16<<16 | MEGAMUX_LP_GPIO_16_UART0_RXD<<8 | MUX_LP_GPIO_16_MEGAMUX )
#define PINMUX_LP_GPIO_16_M_32KHZ_CLK             ( PIN_LP_GPIO_16<<16 | MEGAMUX_LP_GPIO_16_32KHZ_CLK<<8 | MUX_LP_GPIO_16_MEGAMUX )
#define PINMUX_LP_GPIO_16_M_COEX_BLE_IN_PROCESS   ( PIN_LP_GPIO_16<<16 | MEGAMUX_LP_GPIO_16_COEX_BLE_IN_PROCESS<<8 | MUX_LP_GPIO_16_MEGAMUX )
#define PINMUX_LP_GPIO_16_M_UART0_TXD             ( PIN_LP_GPIO_16<<16 | MEGAMUX_LP_GPIO_16_UART0_TXD<<8 | MUX_LP_GPIO_16_MEGAMUX )
#define PINMUX_LP_GPIO_16_M_UART1_TXD             ( PIN_LP_GPIO_16<<16 | MEGAMUX_LP_GPIO_16_UART1_TXD<<8 | MUX_LP_GPIO_16_MEGAMUX )
#define PINMUX_LP_GPIO_16_M_I2C1_SCL              ( PIN_LP_GPIO_16<<16 | MEGAMUX_LP_GPIO_16_I2C1_SCL<<8 | MUX_LP_GPIO_16_MEGAMUX )
#define PINMUX_LP_GPIO_16_M_COEX_WLAN_RX          ( PIN_LP_GPIO_16<<16 | MEGAMUX_LP_GPIO_16_COEX_WLAN_RX<<8 | MUX_LP_GPIO_16_MEGAMUX )
#define PINMUX_LP_GPIO_16_M_COEX_WLAN_TX          ( PIN_LP_GPIO_16<<16 | MEGAMUX_LP_GPIO_16_COEX_WLAN_TX<<8 | MUX_LP_GPIO_16_MEGAMUX )
#define PINMUX_LP_GPIO_16_M_PWM1_OUT              ( PIN_LP_GPIO_16<<16 | MEGAMUX_LP_GPIO_16_PWM1_OUT<<8 | MUX_LP_GPIO_16_MEGAMUX )
#define PINMUX_LP_GPIO_16_M_QUAD_DEC0_B           ( PIN_LP_GPIO_16<<16 | MEGAMUX_LP_GPIO_16_QUAD_DEC0_B<<8 | MUX_LP_GPIO_16_MEGAMUX )
#define PINMUX_LP_GPIO_16_M_UART1_RTS             ( PIN_LP_GPIO_16<<16 | MEGAMUX_LP_GPIO_16_UART1_RTS<<8 | MUX_LP_GPIO_16_MEGAMUX )
#define PINMUX_LP_GPIO_16_M_UART0_CTS             ( PIN_LP_GPIO_16<<16 | MEGAMUX_LP_GPIO_16_UART0_CTS<<8 | MUX_LP_GPIO_16_MEGAMUX )
#define PINMUX_LP_GPIO_16_M_UART1_RXD             ( PIN_LP_GPIO_16<<16 | MEGAMUX_LP_GPIO_16_UART1_RXD<<8 | MUX_LP_GPIO_16_MEGAMUX )
#define PINMUX_LP_GPIO_16_M_COEX_BLE_PTI_0        ( PIN_LP_GPIO_16<<16 | MEGAMUX_LP_GPIO_16_COEX_BLE_PTI_0<<8 | MUX_LP_GPIO_16_MEGAMUX )
#define PINMUX_LP_GPIO_16_M_COEX_BLE_PTI_1        ( PIN_LP_GPIO_16<<16 | MEGAMUX_LP_GPIO_16_COEX_BLE_PTI_1<<8 | MUX_LP_GPIO_16_MEGAMUX )
#define PINMUX_LP_GPIO_16_M_COEX_BLE_PTI_2        ( PIN_LP_GPIO_16<<16 | MEGAMUX_LP_GPIO_16_COEX_BLE_PTI_2<<8 | MUX_LP_GPIO_16_MEGAMUX )
#define PINMUX_LP_GPIO_16_M_COEX_BLE_PTI_3        ( PIN_LP_GPIO_16<<16 | MEGAMUX_LP_GPIO_16_COEX_BLE_PTI_3<<8 | MUX_LP_GPIO_16_MEGAMUX )
#define PINMUX_LP_GPIO_16_M_I2C1_SDA              ( PIN_LP_GPIO_16<<16 | MEGAMUX_LP_GPIO_16_I2C1_SDA<<8 | MUX_LP_GPIO_16_MEGAMUX )
#define PINMUX_LP_GPIO_16_M_I2C0_SDA              ( PIN_LP_GPIO_16<<16 | MEGAMUX_LP_GPIO_16_I2C0_SDA<<8 | MUX_LP_GPIO_16_MEGAMUX )
#define PINMUX_LP_GPIO_16_M_COEX_BLE_SYNC         ( PIN_LP_GPIO_16<<16 | MEGAMUX_LP_GPIO_16_COEX_BLE_SYNC<<8 | MUX_LP_GPIO_16_MEGAMUX )
#define PINMUX_LP_GPIO_16_M_QUAD_DEC2_A           ( PIN_LP_GPIO_16<<16 | MEGAMUX_LP_GPIO_16_QUAD_DEC2_A<<8 | MUX_LP_GPIO_16_MEGAMUX )
#define PINMUX_LP_GPIO_16_M_QUAD_DEC2_B           ( PIN_LP_GPIO_16<<16 | MEGAMUX_LP_GPIO_16_QUAD_DEC2_B<<8 | MUX_LP_GPIO_16_MEGAMUX )
#define PINMUX_LP_GPIO_16_M_COEX_BLE_RX           ( PIN_LP_GPIO_16<<16 | MEGAMUX_LP_GPIO_16_COEX_BLE_RX<<8 | MUX_LP_GPIO_16_MEGAMUX )
#define PINMUX_LP_GPIO_16_M_QUAD_DEC1_B           ( PIN_LP_GPIO_16<<16 | MEGAMUX_LP_GPIO_16_QUAD_DEC1_B<<8 | MUX_LP_GPIO_16_MEGAMUX )
#define PINMUX_LP_GPIO_16_M_PWM3_OUT              ( PIN_LP_GPIO_16<<16 | MEGAMUX_LP_GPIO_16_PWM3_OUT<<8 | MUX_LP_GPIO_16_MEGAMUX )
#define PINMUX_LP_GPIO_16_M_COEX_BLE_RXNTX        ( PIN_LP_GPIO_16<<16 | MEGAMUX_LP_GPIO_16_COEX_BLE_RXNTX<<8 | MUX_LP_GPIO_16_MEGAMUX )
#define PINMUX_LP_GPIO_16_M_QUAD_DEC0_A           ( PIN_LP_GPIO_16<<16 | MEGAMUX_LP_GPIO_16_QUAD_DEC0_A<<8 | MUX_LP_GPIO_16_MEGAMUX )
#define PINMUX_LP_GPIO_16_M_PWM0_OUT              ( PIN_LP_GPIO_16<<16 | MEGAMUX_LP_GPIO_16_PWM0_OUT<<8 | MUX_LP_GPIO_16_MEGAMUX )
#define PINMUX_LP_GPIO_16_M_QUAD_DEC1_A           ( PIN_LP_GPIO_16<<16 | MEGAMUX_LP_GPIO_16_QUAD_DEC1_A<<8 | MUX_LP_GPIO_16_MEGAMUX )
#define PINMUX_LP_GPIO_16_M_PWM2_OUT              ( PIN_LP_GPIO_16<<16 | MEGAMUX_LP_GPIO_16_PWM2_OUT<<8 | MUX_LP_GPIO_16_MEGAMUX )
#define PINMUX_LP_GPIO_16_SPI_FLASH0_SCK          ( PIN_LP_GPIO_16<<16 | MUX_LP_GPIO_16_SPI_FLASH0_SCK )
#define PINMUX_LP_GPIO_16_TEST_OUT_16             ( PIN_LP_GPIO_16<<16 | MUX_LP_GPIO_16_TEST_OUT_16 )
#define PINMUX_LP_GPIO_16_SPI_FLASH0_SSN          ( PIN_LP_GPIO_16<<16 | MUX_LP_GPIO_16_SPI_FLASH0_SSN )
#define PINMUX_LP_GPIO_16_GPIO                    ( PIN_LP_GPIO_16<<16 | MUX_LP_GPIO_16_GPIO )
#define PINMUX_LP_GPIO_16_SPI1_SSN                ( PIN_LP_GPIO_16<<16 | MUX_LP_GPIO_16_SPI1_SSN )
#define PINMUX_LP_GPIO_16_SPI0_SCK                ( PIN_LP_GPIO_16<<16 | MUX_LP_GPIO_16_SPI0_SCK )
/* PinMux macros for LP_GPIO_17 */
#define PINMUX_LP_GPIO_17_SPI0_MOSI               ( PIN_LP_GPIO_17<<16 | MUX_LP_GPIO_17_SPI0_MOSI )
#define PINMUX_LP_GPIO_17_M_I2C0_SCL              ( PIN_LP_GPIO_17<<16 | MEGAMUX_LP_GPIO_17_I2C0_SCL<<8 | MUX_LP_GPIO_17_MEGAMUX )
#define PINMUX_LP_GPIO_17_M_UART1_CTS             ( PIN_LP_GPIO_17<<16 | MEGAMUX_LP_GPIO_17_UART1_CTS<<8 | MUX_LP_GPIO_17_MEGAMUX )
#define PINMUX_LP_GPIO_17_M_COEX_BLE_MBSY         ( PIN_LP_GPIO_17<<16 | MEGAMUX_LP_GPIO_17_COEX_BLE_MBSY<<8 | MUX_LP_GPIO_17_MEGAMUX )
#define PINMUX_LP_GPIO_17_M_COEX_BLE_TX           ( PIN_LP_GPIO_17<<16 | MEGAMUX_LP_GPIO_17_COEX_BLE_TX<<8 | MUX_LP_GPIO_17_MEGAMUX )
#define PINMUX_LP_GPIO_17_M_UART0_RTS             ( PIN_LP_GPIO_17<<16 | MEGAMUX_LP_GPIO_17_UART0_RTS<<8 | MUX_LP_GPIO_17_MEGAMUX )
#define PINMUX_LP_GPIO_17_M_UART0_RXD             ( PIN_LP_GPIO_17<<16 | MEGAMUX_LP_GPIO_17_UART0_RXD<<8 | MUX_LP_GPIO_17_MEGAMUX )
#define PINMUX_LP_GPIO_17_M_32KHZ_CLK             ( PIN_LP_GPIO_17<<16 | MEGAMUX_LP_GPIO_17_32KHZ_CLK<<8 | MUX_LP_GPIO_17_MEGAMUX )
#define PINMUX_LP_GPIO_17_M_COEX_BLE_IN_PROCESS   ( PIN_LP_GPIO_17<<16 | MEGAMUX_LP_GPIO_17_COEX_BLE_IN_PROCESS<<8 | MUX_LP_GPIO_17_MEGAMUX )
#define PINMUX_LP_GPIO_17_M_UART0_TXD             ( PIN_LP_GPIO_17<<16 | MEGAMUX_LP_GPIO_17_UART0_TXD<<8 | MUX_LP_GPIO_17_MEGAMUX )
#define PINMUX_LP_GPIO_17_M_UART1_TXD             ( PIN_LP_GPIO_17<<16 | MEGAMUX_LP_GPIO_17_UART1_TXD<<8 | MUX_LP_GPIO_17_MEGAMUX )
#define PINMUX_LP_GPIO_17_M_I2C1_SCL              ( PIN_LP_GPIO_17<<16 | MEGAMUX_LP_GPIO_17_I2C1_SCL<<8 | MUX_LP_GPIO_17_MEGAMUX )
#define PINMUX_LP_GPIO_17_M_COEX_WLAN_RX          ( PIN_LP_GPIO_17<<16 | MEGAMUX_LP_GPIO_17_COEX_WLAN_RX<<8 | MUX_LP_GPIO_17_MEGAMUX )
#define PINMUX_LP_GPIO_17_M_COEX_WLAN_TX          ( PIN_LP_GPIO_17<<16 | MEGAMUX_LP_GPIO_17_COEX_WLAN_TX<<8 | MUX_LP_GPIO_17_MEGAMUX )
#define PINMUX_LP_GPIO_17_M_PWM1_OUT              ( PIN_LP_GPIO_17<<16 | MEGAMUX_LP_GPIO_17_PWM1_OUT<<8 | MUX_LP_GPIO_17_MEGAMUX )
#define PINMUX_LP_GPIO_17_M_QUAD_DEC0_B           ( PIN_LP_GPIO_17<<16 | MEGAMUX_LP_GPIO_17_QUAD_DEC0_B<<8 | MUX_LP_GPIO_17_MEGAMUX )
#define PINMUX_LP_GPIO_17_M_UART1_RTS             ( PIN_LP_GPIO_17<<16 | MEGAMUX_LP_GPIO_17_UART1_RTS<<8 | MUX_LP_GPIO_17_MEGAMUX )
#define PINMUX_LP_GPIO_17_M_UART0_CTS             ( PIN_LP_GPIO_17<<16 | MEGAMUX_LP_GPIO_17_UART0_CTS<<8 | MUX_LP_GPIO_17_MEGAMUX )
#define PINMUX_LP_GPIO_17_M_UART1_RXD             ( PIN_LP_GPIO_17<<16 | MEGAMUX_LP_GPIO_17_UART1_RXD<<8 | MUX_LP_GPIO_17_MEGAMUX )
#define PINMUX_LP_GPIO_17_M_COEX_BLE_PTI_0        ( PIN_LP_GPIO_17<<16 | MEGAMUX_LP_GPIO_17_COEX_BLE_PTI_0<<8 | MUX_LP_GPIO_17_MEGAMUX )
#define PINMUX_LP_GPIO_17_M_COEX_BLE_PTI_1        ( PIN_LP_GPIO_17<<16 | MEGAMUX_LP_GPIO_17_COEX_BLE_PTI_1<<8 | MUX_LP_GPIO_17_MEGAMUX )
#define PINMUX_LP_GPIO_17_M_COEX_BLE_PTI_2        ( PIN_LP_GPIO_17<<16 | MEGAMUX_LP_GPIO_17_COEX_BLE_PTI_2<<8 | MUX_LP_GPIO_17_MEGAMUX )
#define PINMUX_LP_GPIO_17_M_COEX_BLE_PTI_3        ( PIN_LP_GPIO_17<<16 | MEGAMUX_LP_GPIO_17_COEX_BLE_PTI_3<<8 | MUX_LP_GPIO_17_MEGAMUX )
#define PINMUX_LP_GPIO_17_M_I2C1_SDA              ( PIN_LP_GPIO_17<<16 | MEGAMUX_LP_GPIO_17_I2C1_SDA<<8 | MUX_LP_GPIO_17_MEGAMUX )
#define PINMUX_LP_GPIO_17_M_I2C0_SDA              ( PIN_LP_GPIO_17<<16 | MEGAMUX_LP_GPIO_17_I2C0_SDA<<8 | MUX_LP_GPIO_17_MEGAMUX )
#define PINMUX_LP_GPIO_17_M_COEX_BLE_SYNC         ( PIN_LP_GPIO_17<<16 | MEGAMUX_LP_GPIO_17_COEX_BLE_SYNC<<8 | MUX_LP_GPIO_17_MEGAMUX )
#define PINMUX_LP_GPIO_17_M_QUAD_DEC2_A           ( PIN_LP_GPIO_17<<16 | MEGAMUX_LP_GPIO_17_QUAD_DEC2_A<<8 | MUX_LP_GPIO_17_MEGAMUX )
#define PINMUX_LP_GPIO_17_M_QUAD_DEC2_B           ( PIN_LP_GPIO_17<<16 | MEGAMUX_LP_GPIO_17_QUAD_DEC2_B<<8 | MUX_LP_GPIO_17_MEGAMUX )
#define PINMUX_LP_GPIO_17_M_COEX_BLE_RX           ( PIN_LP_GPIO_17<<16 | MEGAMUX_LP_GPIO_17_COEX_BLE_RX<<8 | MUX_LP_GPIO_17_MEGAMUX )
#define PINMUX_LP_GPIO_17_M_QUAD_DEC1_B           ( PIN_LP_GPIO_17<<16 | MEGAMUX_LP_GPIO_17_QUAD_DEC1_B<<8 | MUX_LP_GPIO_17_MEGAMUX )
#define PINMUX_LP_GPIO_17_M_PWM3_OUT              ( PIN_LP_GPIO_17<<16 | MEGAMUX_LP_GPIO_17_PWM3_OUT<<8 | MUX_LP_GPIO_17_MEGAMUX )
#define PINMUX_LP_GPIO_17_M_COEX_BLE_RXNTX        ( PIN_LP_GPIO_17<<16 | MEGAMUX_LP_GPIO_17_COEX_BLE_RXNTX<<8 | MUX_LP_GPIO_17_MEGAMUX )
#define PINMUX_LP_GPIO_17_M_QUAD_DEC0_A           ( PIN_LP_GPIO_17<<16 | MEGAMUX_LP_GPIO_17_QUAD_DEC0_A<<8 | MUX_LP_GPIO_17_MEGAMUX )
#define PINMUX_LP_GPIO_17_M_PWM0_OUT              ( PIN_LP_GPIO_17<<16 | MEGAMUX_LP_GPIO_17_PWM0_OUT<<8 | MUX_LP_GPIO_17_MEGAMUX )
#define PINMUX_LP_GPIO_17_M_QUAD_DEC1_A           ( PIN_LP_GPIO_17<<16 | MEGAMUX_LP_GPIO_17_QUAD_DEC1_A<<8 | MUX_LP_GPIO_17_MEGAMUX )
#define PINMUX_LP_GPIO_17_M_PWM2_OUT              ( PIN_LP_GPIO_17<<16 | MEGAMUX_LP_GPIO_17_PWM2_OUT<<8 | MUX_LP_GPIO_17_MEGAMUX )
#define PINMUX_LP_GPIO_17_TEST_OUT_17             ( PIN_LP_GPIO_17<<16 | MUX_LP_GPIO_17_TEST_OUT_17 )
#define PINMUX_LP_GPIO_17_SPI1_SCK                ( PIN_LP_GPIO_17<<16 | MUX_LP_GPIO_17_SPI1_SCK )
#define PINMUX_LP_GPIO_17_SPI_FLASH0_TXD          ( PIN_LP_GPIO_17<<16 | MUX_LP_GPIO_17_SPI_FLASH0_TXD )
#define PINMUX_LP_GPIO_17_GPIO                    ( PIN_LP_GPIO_17<<16 | MUX_LP_GPIO_17_GPIO )
/* PinMux macros for LP_GPIO_18 */
#define PINMUX_LP_GPIO_18_SPI_FLASH0_RXD          ( PIN_LP_GPIO_18<<16 | MUX_LP_GPIO_18_SPI_FLASH0_RXD )
#define PINMUX_LP_GPIO_18_M_I2C0_SCL              ( PIN_LP_GPIO_18<<16 | MEGAMUX_LP_GPIO_18_I2C0_SCL<<8 | MUX_LP_GPIO_18_MEGAMUX )
#define PINMUX_LP_GPIO_18_M_UART1_CTS             ( PIN_LP_GPIO_18<<16 | MEGAMUX_LP_GPIO_18_UART1_CTS<<8 | MUX_LP_GPIO_18_MEGAMUX )
#define PINMUX_LP_GPIO_18_M_COEX_BLE_MBSY         ( PIN_LP_GPIO_18<<16 | MEGAMUX_LP_GPIO_18_COEX_BLE_MBSY<<8 | MUX_LP_GPIO_18_MEGAMUX )
#define PINMUX_LP_GPIO_18_M_COEX_BLE_TX           ( PIN_LP_GPIO_18<<16 | MEGAMUX_LP_GPIO_18_COEX_BLE_TX<<8 | MUX_LP_GPIO_18_MEGAMUX )
#define PINMUX_LP_GPIO_18_M_UART0_RTS             ( PIN_LP_GPIO_18<<16 | MEGAMUX_LP_GPIO_18_UART0_RTS<<8 | MUX_LP_GPIO_18_MEGAMUX )
#define PINMUX_LP_GPIO_18_M_UART0_RXD             ( PIN_LP_GPIO_18<<16 | MEGAMUX_LP_GPIO_18_UART0_RXD<<8 | MUX_LP_GPIO_18_MEGAMUX )
#define PINMUX_LP_GPIO_18_M_32KHZ_CLK             ( PIN_LP_GPIO_18<<16 | MEGAMUX_LP_GPIO_18_32KHZ_CLK<<8 | MUX_LP_GPIO_18_MEGAMUX )
#define PINMUX_LP_GPIO_18_M_COEX_BLE_IN_PROCESS   ( PIN_LP_GPIO_18<<16 | MEGAMUX_LP_GPIO_18_COEX_BLE_IN_PROCESS<<8 | MUX_LP_GPIO_18_MEGAMUX )
#define PINMUX_LP_GPIO_18_M_UART0_TXD             ( PIN_LP_GPIO_18<<16 | MEGAMUX_LP_GPIO_18_UART0_TXD<<8 | MUX_LP_GPIO_18_MEGAMUX )
#define PINMUX_LP_GPIO_18_M_UART1_TXD             ( PIN_LP_GPIO_18<<16 | MEGAMUX_LP_GPIO_18_UART1_TXD<<8 | MUX_LP_GPIO_18_MEGAMUX )
#define PINMUX_LP_GPIO_18_M_I2C1_SCL              ( PIN_LP_GPIO_18<<16 | MEGAMUX_LP_GPIO_18_I2C1_SCL<<8 | MUX_LP_GPIO_18_MEGAMUX )
#define PINMUX_LP_GPIO_18_M_COEX_WLAN_RX          ( PIN_LP_GPIO_18<<16 | MEGAMUX_LP_GPIO_18_COEX_WLAN_RX<<8 | MUX_LP_GPIO_18_MEGAMUX )
#define PINMUX_LP_GPIO_18_M_COEX_WLAN_TX          ( PIN_LP_GPIO_18<<16 | MEGAMUX_LP_GPIO_18_COEX_WLAN_TX<<8 | MUX_LP_GPIO_18_MEGAMUX )
#define PINMUX_LP_GPIO_18_M_PWM1_OUT              ( PIN_LP_GPIO_18<<16 | MEGAMUX_LP_GPIO_18_PWM1_OUT<<8 | MUX_LP_GPIO_18_MEGAMUX )
#define PINMUX_LP_GPIO_18_M_QUAD_DEC0_B           ( PIN_LP_GPIO_18<<16 | MEGAMUX_LP_GPIO_18_QUAD_DEC0_B<<8 | MUX_LP_GPIO_18_MEGAMUX )
#define PINMUX_LP_GPIO_18_M_UART1_RTS             ( PIN_LP_GPIO_18<<16 | MEGAMUX_LP_GPIO_18_UART1_RTS<<8 | MUX_LP_GPIO_18_MEGAMUX )
#define PINMUX_LP_GPIO_18_M_UART0_CTS             ( PIN_LP_GPIO_18<<16 | MEGAMUX_LP_GPIO_18_UART0_CTS<<8 | MUX_LP_GPIO_18_MEGAMUX )
#define PINMUX_LP_GPIO_18_M_UART1_RXD             ( PIN_LP_GPIO_18<<16 | MEGAMUX_LP_GPIO_18_UART1_RXD<<8 | MUX_LP_GPIO_18_MEGAMUX )
#define PINMUX_LP_GPIO_18_M_COEX_BLE_PTI_0        ( PIN_LP_GPIO_18<<16 | MEGAMUX_LP_GPIO_18_COEX_BLE_PTI_0<<8 | MUX_LP_GPIO_18_MEGAMUX )
#define PINMUX_LP_GPIO_18_M_COEX_BLE_PTI_1        ( PIN_LP_GPIO_18<<16 | MEGAMUX_LP_GPIO_18_COEX_BLE_PTI_1<<8 | MUX_LP_GPIO_18_MEGAMUX )
#define PINMUX_LP_GPIO_18_M_COEX_BLE_PTI_2        ( PIN_LP_GPIO_18<<16 | MEGAMUX_LP_GPIO_18_COEX_BLE_PTI_2<<8 | MUX_LP_GPIO_18_MEGAMUX )
#define PINMUX_LP_GPIO_18_M_COEX_BLE_PTI_3        ( PIN_LP_GPIO_18<<16 | MEGAMUX_LP_GPIO_18_COEX_BLE_PTI_3<<8 | MUX_LP_GPIO_18_MEGAMUX )
#define PINMUX_LP_GPIO_18_M_I2C1_SDA              ( PIN_LP_GPIO_18<<16 | MEGAMUX_LP_GPIO_18_I2C1_SDA<<8 | MUX_LP_GPIO_18_MEGAMUX )
#define PINMUX_LP_GPIO_18_M_I2C0_SDA              ( PIN_LP_GPIO_18<<16 | MEGAMUX_LP_GPIO_18_I2C0_SDA<<8 | MUX_LP_GPIO_18_MEGAMUX )
#define PINMUX_LP_GPIO_18_M_COEX_BLE_SYNC         ( PIN_LP_GPIO_18<<16 | MEGAMUX_LP_GPIO_18_COEX_BLE_SYNC<<8 | MUX_LP_GPIO_18_MEGAMUX )
